<?xml version="1.0"?>
<content collectionGUID="84341F66-B8FE-4E3D-8495-6E0E0E951A48">
  <lastEdited clientType="local-build-20130624" date="2013-06-24 01:27:20 +0900"/>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;&#xFF3B;&#x65E5;&#x8A8C;&#xFF3D;&lt;/b&gt;&lt;b&gt;&lt;a href="http://www.smalltalk-users.jp/Home/gao-zhi/dai51kaismalltalkbenkyoukai"&gt;&#x7B2C;51&#x56DE; Smalltalk&#x52C9;&#x5F37;&#x4F1A;&lt;/a&gt;&lt;/b&gt;&lt;b&gt; &#x3067;&#x30D7;&#x30EC;&#x30BC;&#x30F3;&#x3092;&#x884C;&#x3063;&#x305F;&#xFF1A; F-Script &#x306E;&#x6982;&#x8981;&#x7D39;&#x4ECB;&#xFF06;&#x30C7;&#x30E2;&lt;/b&gt;</richText>
  </textBox>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>&#x4ECA;&#x65E5;&#x306F;&#x3001;&lt;a href="http://www.smalltalk-users.jp/Home"&gt;Smalltalk-users-jp&lt;/a&gt; &#x306E;&#x6885;&#x6FA4;&#x3055;&#x3093;&#x304C;&#x6771;&#x4EAC;&#x3067;&#x6BCE;&#x6708;&#x958B;&#x50AC;&#x3057;&#x3066;&#x3044;&#x308B; &lt;a href="http://www.smalltalk-users.jp/Home/gao-zhi/dai51kaismalltalkbenkyoukai"&gt;Smalltalk&#x52C9;&#x5F37;&#x4F1A;&lt;/a&gt; &#x3067;&#x3001;F-Script &#x306E;&#x6982;&#x8981;&#x7D39;&#x4ECB;&#x3068;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x30C7;&#x30E2;&#x304B;&#x3089;&#x306A;&#x308B;&#x30D7;&#x30EC;&#x30BC;&#x30F3;&#x3092;&#x3055;&#x305B;&#x3066;&#x9802;&#x3044;&#x305F;&#x3002;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306F;&#x300C;F-Script &#x7B2C;2&#x56DE; - Mac OS X &#x304C; Smalltalk &#x306B;&#x306A;&#x3063;&#x3061;&#x3083;&#x3046;&#xFF01;&#x300D;&#xD;&#x3053;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306F;&#x3001;&lt;a href="http://www.smalltalk-users.jp/Home/gao-zhi/dai28kaismalltalkbenkyoukai"&gt;&#x4E8C;&#x5E74;&#x524D;&#x306E;&#xFF11;&#x6708;&#x306E; Smalltalk&#x52C9;&#x5F37;&#x4F1A;&lt;/a&gt; &#x306B;&#x304A;&#x3051;&#x308B; &lt;a href="https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=c21hbGx0YWxrLXVzZXJzLmpwfGhvbWV8Z3g6NmYzMzdmNzQ4ZTBiNzJmZQ"&gt;&#x6797;&#x5FB9;&#x4E5F;&#x3055;&#x3093;&#x306E; F-Script &#x306B;&#x95A2;&#x3059;&#x308B;&#x6700;&#x521D;&#x306E;&#x767A;&#x8868;&lt;/a&gt;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3092;&#x305D;&#x306E;&#x307E;&#x307E;&#x62DD;&#x501F;&#x3055;&#x305B;&#x3066;&#x9802;&#x3044;&#x3066;&#x3001;&#x305D;&#x306E;&#x300C;&#x7B2C;2&#x56DE;&#x300D;&#x3068;&#x3057;&#x305F;&#x3082;&#x306E;&#x3060;&#x3002;&#xD;&#xD;F-Script &#x306B;&#x306F; &#x5927;&#x5225;&#x3057;&#x3066;&#x4E8C;&#x3064;&#x306E;&#x5074;&#x9762;&#x304C;&#x3042;&#x308B;&#x3002;&#xD;&#x305D;&#x306E;&#x4E00;&#x3064;&#x306F;&#x3001;&#x300C;Cocoa &#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x74B0;&#x5883;&#x306E;&#x63D0;&#x4F9B;&#x300D;&#x3068;&#x3044;&#x3046;&#x5B9F;&#x8DF5;&#x6539;&#x5584;&#x7684;&#x306A;&#x5074;&#x9762;&#x3067;&#x3042;&#x308A;&#x3001;&#x3082;&#x3046;&#x4E00;&#x3064;&#x306F;&#x3001;&#x300C;OOPAL&#xFF08;Object Oriented Programming and Array programming Language integration&#xFF09;&#x3068;&#x3044;&#x3046;&#x9769;&#x65B0;&#x7684;&#x8A00;&#x8A9E;&#x74B0;&#x5883;&#x306E;&#x5177;&#x4F53;&#x7684;&#x63D0;&#x6848;&#x300D;&#x3068;&#x3044;&#x3046;&#x5B9F;&#x9A13;&#x7684;&#x306A;&#x5074;&#x9762;&#x3060;&#x3002;&lt;a href="https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=c21hbGx0YWxrLXVzZXJzLmpwfGhvbWV8Z3g6NmYzMzdmNzQ4ZTBiNzJmZQ"&gt;&#x524D;&#x56DE;&#x306E;&#x6797;&#x3055;&#x3093;&#x306E;&#x767A;&#x8868;&#x8CC7;&#x6599;&lt;/a&gt;&#x306B;&#x306F;&#x3001;&#x305D;&#x306E;&#x5168;&#x4F53;&#x50CF;&#x304C;&#x3001;&#x504F;&#x308A;&#x7121;&#x304F;&#x975E;&#x5E38;&#x306B;&#x7C21;&#x6F54;&#x306B;&#x8981;&#x7D04;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#xD;&#x305D;&#x3053;&#x3067;&#x3001;&#x4ECA;&#x56DE;&#x306E;&#x767A;&#x8868;&#x3067;&#x306F;&#x3001;&#x3053;&#x306E;&#x4E8C;&#x3064;&#x306E;&#x5074;&#x9762;&#x306E;&#x3046;&#x3061;&#x3001;&#x524D;&#x8005;&#x306B;&#x7126;&#x70B9;&#x3092;&#x7D5E;&#x308A;&#x3001;&#x305D;&#x306E;&#x7279;&#x5FB4;&#x3068;&#x4F7F;&#x3044;&#x65B9;&#x3092;&#x3001;&#x5B9F;&#x4F8B;&#x30C7;&#x30E2;&#x3092;&#x542B;&#x3081;&#x3066;&#x3084;&#x3084;&#x8A73;&#x3057;&#x304F;&#x7D39;&#x4ECB;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x4ECA;&#x56DE;&#x306E;&#x767A;&#x8868;&#x306E;&#x30A2;&#x30B8;&#x30A7;&#x30F3;&#x30C0;&#xD;&lt;/b&gt;&lt;b&gt;&#xD;&#x30FB;F-Script &#x65E5;&#x672C;&#x8A9E;&#x30B5;&#x30A4;&#x30C8; F-Script-ja &#x306E;&#x7D39;&#x4ECB;&#xD;&lt;/b&gt;&#x3000;&#x52D5;&#x6A5F;&#xFF0F;&#x7ACB;&#x3061;&#x4E0A;&#x3052;&#x307E;&#x3067;&#x306E;&#x7D4C;&#x7DEF;&#xFF0F;&#x30B5;&#x30A4;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x306A;&#x3069;&#xD;&#xD;    &#x30FB;F-Script &#x3068;&#x306F;&#xD;    &#x30FB;F-Script-ja &#x306E;&#x7D39;&#x4ECB; 1/2 2/2&#xD;    &#x30FB;&#x914D;&#x5E03;&#x7269;&#xD;&#xD;&lt;b&gt;&#x30FB;F-Script &#x57FA;&#x790E;&#x7DE8;&#xD;&lt;/b&gt;&#x3000;&#x6797;&#x5FB9;&#x4E5F;&#x3055;&#x3093;&#x306E;&#x7B2C;&#xFF11;&#x56DE;&#x8CC7;&#x6599;&#x3092;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x57FA;&#x790E;&#x77E5;&#x8B58;&#x3092;&#x5FA9;&#x7FD2;&#xD;&#xD;    &#x30FB;F-Script &#x306E;&#x4E8C;&#x3064;&#x306E;&#x5074;&#x9762;&#xD;    &#x30FB;&#x5229;&#x7528;&#x30B7;&#x30FC;&#x30F3;&#xD;    &#x30FB;&#x30C4;&#x30FC;&#x30EB;&#xFF0F;&#x74B0;&#x5883;&#xD;    &#x30FB;Console&#xD;    &#x30FB;Browser&#xD;    &#x30FB;&#x7DE8;&#x96C6;&#xFF0F;&#x5B9F;&#x884C;&#xFF1A;&#xFF13;&#x3064;&#x306E;&#x65B9;&#x6CD5;&#xD;    &#x30FB;&#x4FDD;&#x5B58;&#x306E;&#x65B9;&#x6CD5;&#xD;    &#x30FB;OOPAL &#x8A00;&#x8A9E; 1/2 &#x30AF;&#x30E9;&#x30B9;&#x5B9A;&#x7FA9;&#xD;    &#x30FB;OOPAL &#x8A00;&#x8A9E; 2/2 &#x5B9F;&#x884C;&#x74B0;&#x5883;&#xD;    &#x30FB;Objective-C &#x3068;&#x306E;&#x6BD4;&#x8F03;&#xD;    &#x30FB;Smalltalk &#x3068;&#x306E;&#x6BD4;&#x8F03; 1/3 2/3 3/3&#xD;&#xD;&lt;b&gt;&#x30FB;F-Script &#x5B9F;&#x8DF5;&#x7DE8; - Let&#x2019;s enjoy Cocoa Scripting !!&#xD;&lt;/b&gt;&#x3000;&#x5B9F;&#x969B;&#x306B;&#x52D5;&#x304B;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#xD;&#xD;    &#x30FB;&#x30C7;&#x30E2; 1/2 &#xD;        &#x30FB;FollowingCircleView.fs&#xD;    &#x30FB;&#x30C7;&#x30E2; 2/2&#xD;        &#x30FB;F-Script &#x3067; F-Script &#x81EA;&#x8EAB;&#x3092;&#x64CD;&#x4F5C;&#xFF0F;&#x6539;&#x9020;&#x3059;&#x308B;&#xD;    &#x30FB;&#x5FC5;&#x8981;&#x306A;&#x77E5;&#x8B58; 1/3 2/3 3/3&#xD;    &#x30FB;&#x5B9F;&#x8DF5;&#xFF1A;doit! 1/2&#xD;        &#x30FB;&#x672C;&#x65E5;&#x914D;&#x4ED8;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x4E2D;&#x8EAB;&#xD;    &#x30FB;&#x5B9F;&#x8DF5;&#xFF1A;doit! 2/2&#xD;        &#x30FB;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x30B5;&#x30F3;&#x30D7;&#x30EB;&#x3092;&#x52D5;&#x304B;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#xFF01;&#xD;        &#x30FB;&#x672C;&#x65E5;&#x306E;&#x914D;&#x4ED8;&#x30B5;&#x30F3;&#x30D7;&#x30EB;&#x3092;&#x52D5;&#x304B;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#xFF01;&#xD;        &#x30FB;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x3092;&#x3042;&#x308C;&#x3053;&#x308C;&#x6539;&#x9020;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#xFF01; &#xD;&#xD;&lt;b&gt;&#x30FB;&#x672C;&#x5BB6;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x306B;&#x8F09;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044; Tips &#x306E;&#x7D39;&#x4ECB;&#xD;&lt;/b&gt;&#x3000;IB &#x3067;&#x5275;&#x3063;&#x305F; nib &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092; F-Script &#x304B;&#x3089;&#x4F7F;&#x3046;&#x306B;&#x306F;&#xD;&#xD;    &#x30FB;additional Tips 1/2&#xD;        &#x30FB;IB &#x3067;&#x5275;&#x3063;&#x305F; GUI&#xFF08;nib&#xFF09;&#x3092; F-Script &#x304B;&#x3089;&#x4F7F;&#x3046;&#x306B;&#x306F;&#xD;    &#x30FB;additional Tips 2/2&#xD;        &#x30FB;NSNib &#x3092;&#x4F7F;&#x3063;&#x305F; nib &#x306E;&#x8AAD;&#x307F;&#x8FBC;&#x307F;&#x65B9;&#xD;    &#x30FB;Future Work&#xD;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x6700;&#x5F8C;&#x306B;&#xD;&lt;/b&gt;&#xD;&#x672C;&#x65E5;&#x306E;&#x767A;&#x8868;&#x306E;&#x73FE;&#x5834;&#x3067;&#x306F;&#x3001;&#x51FA;&#x5E2D;&#x8005;&#x306E;&#x7686;&#x3055;&#x3093;&#x304B;&#x3089;&#x8CEA;&#x554F;&#x3084;&#x95A2;&#x9023;&#x60C5;&#x5831;&#x306A;&#x3069;&#x3092;&#x305F;&#x304F;&#x3055;&#x3093;&#x6234;&#x304D;&#x3001;&#x5927;&#x5909;&#x6709;&#x610F;&#x7FA9;&#x306A;&#x6642;&#x9593;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;&#xD;&#x307E;&#x305F;&#x3001;&#x30C7;&#x30E2;&#x306E;&#x6700;&#x4E2D;&#x306B;&#x3001;&#x4E0D;&#x6E2C;&#x306E;&#x300C;&#x4E0D;&#x5177;&#x5408;&#x300D;&#x304C;&#x51FA;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x969B;&#x306B;&#x306F;&#x3001;&#x4E00;&#x77AC;&#x6050;&#x7E2E;&#x3057;&#x305F;&#x304C;&#x3001;&#x30D6;&#x30FC;&#x30A4;&#x30F3;&#x30B0;&#x3069;&#x3053;&#x308D;&#x304B;&#x3001;&#x6B21;&#x304B;&#x3089;&#x6B21;&#x306B;&#x300C;&#x539F;&#x56E0;&#x7A76;&#x660E;&#x306E;&#x70BA;&#x306E;&#x30A2;&#x30A4;&#x30C7;&#x30A3;&#x30A2;&#x300D;&#x304C;&#x63D0;&#x6848;&#x3055;&#x308C;&#x3001;&#x3044;&#x3064;&#x306E;&#x9593;&#x306B;&#x304B;&#x5834;&#x304C;&#x3001;&#x51FA;&#x5E2D;&#x8005;&#x5168;&#x54E1;&#x7DCF;&#x304C;&#x304B;&#x308A;&#x306E;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x5927;&#x4F1A;&#x3068;&#x5316;&#x3057;&#x3066;&#x3044;&#x305F;&#xFF01;&#xD;&#x4ECA;&#x65E5;&#x306E;&#x51FA;&#x5E2D;&#x8005;&#x306E;&#x7686;&#x3055;&#x3093;&#x5168;&#x54E1;&#x306B;&#x3001;&#x5FC3;&#x304B;&#x3089;&#x611F;&#x8B1D;&#x3057;&#x305F;&#x3044;&#x3002;&#xD;</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;2013&#x5E74;2&#x6708;22&#x65E5;&#x91D1;&#x66DC;&#x65E5;&lt;/b&gt;</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="22_%5Bri_zhi%5D_di51hui_Smalltalk_mian_qiang_hui_de_F-Script_no_gai_yaowo_shao_jie_files/shapeimage_3.png" left="0px" top="0px" width="400px" height="300px"/>
</content>
