<?xml version="1.0"?>
<content collectionGUID="84341F66-B8FE-4E3D-8495-6E0E0E951A48">
  <lastEdited clientType="local-build-20130619" date="2013-06-19 00:19:17 +0900"/>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;&#xFF3B;&#x5165;&#x9580;&#xFF3D;F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB; &#x3092;&#x4F7F;&#x3063;&#x3066;&#x307F;&#x308B;&lt;/b&gt;</richText>
  </textBox>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>F-Script.app &#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3068;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x300C;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x300D;&#x304C;&#x958B;&#x3044;&#x3066;&#x3001;&#x5165;&#x529B;&#x3092;&#x4FC3;&#x3059;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8; &gt; &#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;&#xD;&#x4F55;&#x3089;&#x304B;&#x306E; F-Script &#x30B3;&#x30FC;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x3053;&#x3053;&#x306B;&#x76F4;&#x63A5;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3057;&#x3066;&#x300C;return&#x300D;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x305B;&#x3070;&#x826F;&#x3044;&#x3002;&#xD;&#x5165;&#x529B;&#x3059;&#x3079;&#x304D;&#x30B3;&#x30FC;&#x30C9;&#x304C;&#x8907;&#x6570;&#x884C;&#x306B;&#x6E21;&#x308B;&#x5834;&#x5408;&#x306B;&#x306F;&#x3001;&#x300C;&#x6539;&#x884C;&#x300D;&#x306E;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x300C;Ctrl&#x300D;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089;&#x300C;return&#x300D;&#x3092;&#x62BC;&#x3059;&#x3002;&#xD;&#x3053;&#x3046;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x5373;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x306A;&#x304F;&#x3001;&#x305D;&#x3053;&#x3067;&#x300C;&#x6539;&#x884C;&#x300D;&#x3055;&#x308C;&#x3001;&#x7D99;&#x7D9A;&#x3057;&#x3066;&#x6B21;&#x306E;&#x884C;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&#xD;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x306F;&#x3001;&#x300C;&#x2191;&#x300D;&#x30AD;&#x30FC;&#x3067;&#x904E;&#x53BB;&#x306E;&#x5165;&#x529B;&#x3092;&#x547C;&#x3073;&#x51FA;&#x305B;&#x308B;&#x30D2;&#x30B9;&#x30C8;&#x30EA;&#x30FC;&#x6A5F;&#x80FD;&#x7B49;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x4FBF;&#x5229;&#x306A;&#x6A5F;&#x80FD;&#x304C;&#x3042;&#x308B;&#x304C;&#x3001;&#x8A73;&#x7D30;&#x306F;&#x3001;&lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html"&gt;F-Script Guide&lt;/a&gt; &#x306E; &lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html#mozTocId188792"&gt;&#xFF13; F-Script &#x306E;&#x4F7F;&#x3044;&#x65B9;&lt;/a&gt; &#x3092;&#x898B;&#x3066;&#x6B32;&#x3057;&#x3044;&#x3002;&#xD;&#xD;&#x3067;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x69D8;&#x306B;&#x5165;&#x529B;&#x3057;&#x3066;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002;&#x6B21;&#x306E;&#x884C;&#x306B;&#x305D;&#x306E;&#x7D50;&#x679C;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x3001;&#x6B21;&#x306E;&#x5165;&#x529B;&#x3092;&#x4FC3;&#x3059;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8;&#x304C;&#x51FA;&#x308B;&#x3002;&#xD;&#xD;    &gt; 2 + 3&#x300C;return&#x300D;&#xD;    5&#xD;&#xD;    &gt;&#xD;&#xD;&#x540C;&#x69D8;&#x306B;&#x3057;&#x3066;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x69D8;&#x306B;&#x5165;&#x529B;&#x3057;&#x3066;&#x3001;&#x7D50;&#x679C;&#x3092;&#x78BA;&#x304B;&#x3081;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002;&#xD;&#xD;    &gt; a := 2 + 3&#x300C;return&#x300D;&#xD;&#xD;    &gt; a&#x300C;return&#x300D;&#xD;    5&#xD;&#xD;    &gt; b := 'abc' ++ 'def'&#x300C;return&#x300D;&#xD;&#xD;    &gt; b&#x300C;return&#x300D;&#xD;    'abcdef'&#xD;&#xD;    &gt; b at: 0&#x300C;return&#x300D;&#xD;    'a'&#xD;&#xD;    &gt; b at: 1&#x300C;return&#x300D;&#xD;    'b'&#xD;&#xD;    &gt; b at: 6&#x300C;return&#x300D;&#xD;&#xD;    error: index of a a string must be a number less than the length of the string&#xD;&#xD;    &gt; c := { }&#x300C;return&#x300D;&#xD;&#xD;    &gt; c addObject: 'a'&#x300C;return&#x300D;&#xD;&#xD;    &gt; c&#x300C;return&#x300D;&#xD;    {'a'}&#xD;&#xD;    &gt; c addObject: 'b' &#x300C;return&#x300D;&#xD;&#xD;    &gt; c &#x300C;return&#x300D;&#xD;    {'a', 'b'}&#xD;&#xD;    &gt; c addObject: 100 &#x300C;return&#x300D;&#xD;&#xD;    &gt; c &#x300C;return&#x300D;&#xD;    {'a', 'b', 100}&#xD;&#xD;    &gt; &#xD;&#xD;&#x3055;&#x3042;&#x3001;&#x3053;&#x308C;&#x3067; F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x3082;&#x6163;&#x308C;&#x305F;&#x3053;&#x3068;&#x3068;&#x601D;&#x3046;&#x3002;&#x5F8C;&#x306F;&#x3001;&lt;a href="http://hid2718.github.io/FScript/Documents.html"&gt;F-Script Guide&lt;/a&gt; &#x3068;&#x3001;&lt;a href="http://hid2718.github.io/FScript/Documents.html"&gt;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&lt;/a&gt;&#x3092;&#x53C2;&#x8003;&#x306B;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x3069;&#x3093;&#x3069;&#x3093;&#x5B9F;&#x9A13;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002; &#x7279;&#x306B; &lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html"&gt;F-Script Guide&lt;/a&gt; &#x306B;&#x306F;&#x3001;F-Script &#x306B;&#x95A2;&#x3059;&#x308B;&#x57FA;&#x672C;&#x7684;&#x306A;&#x77E5;&#x8B58;&#x304C;&#x3001;&#x7CFB;&#x7D71;&#x7ACB;&#x3066;&#x3066;&#x89E3;&#x8AAC;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x4F8B;&#x984C;&#x3082;&#x8C4A;&#x5BCC;&#x306A;&#x306E;&#x3067;&#x3001;&#x8AAD;&#x3080;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x8AAD;&#x307F;&#x306A;&#x304C;&#x3089;&#x5B9F;&#x969B;&#x306B;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x307F;&#x308B;&#x3053;&#x3068;&#x3092;&#x5F37;&#x304F;&#x304A;&#x52E7;&#x3081;&#x3057;&#x305F;&#x3044;&#x3002;&#xD;&#xD;&#x6700;&#x5F8C;&#x306B;&#x3001;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x4E0A;&#x3067;&#x65E5;&#x672C;&#x8A9E;&#x6587;&#x5B57;&#x5217;&#x3092;&#x4F7F;&#x3046;&#x5834;&#x5408;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x70B9;&#x306B;&#x6CE8;&#x610F;&#x3057;&#x3066;&#x6B32;&#x3057;&#x3044;&#x3002;&#xD;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x4E0A;&#x3067;&#x3001;&#x76F4;&#x63A5;&#x3001;&#x65E5;&#x672C;&#x8A9E;&#x6587;&#x5B57;&#x5217;&#x3092;&#x5165;&#x529B;&#x3057;&#x3088;&#x3046;&#x3068;&#x3059;&#x308B;&#x3068;&#x3001;&#x5909;&#x63DB;&#x78BA;&#x5B9A;&#x306E; return &#x3067;&#x300C;&#x5B9F;&#x884C;&#x300D;&#x3055;&#x308C;&#x3066;&#x3057;&#x307E;&#x3044;&#x3001;&#x610F;&#x56F3;&#x3057;&#x305F;&#x5165;&#x529B;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x304C;&#x305D;&#x3046;&#x3057;&#x305F;&#x5909;&#x63DB;&#x5165;&#x529B;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x305F;&#x5B9F;&#x88C5;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x70BA;&#x3060;&#x3002;&#xD;&#x3057;&#x304B;&#x3057;&#x3001;&#x4ED6;&#x306E;&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x3084;Web &#x30DA;&#x30FC;&#x30B8;&#x7B49;&#x304B;&#x3089;&#x306E;&#x300C;&#x30B3;&#x30D4;&#x30DA;&#x306B;&#x3088;&#x308B;&#x8EE2;&#x8A18;&#x300D;&#x3067;&#x3042;&#x308C;&#x3070;&#x3001;&#x554F;&#x984C;&#x306A;&#x304F;&#x5165;&#x529B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&#xD;</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;2013&#x5E74;2&#x6708;5&#x65E5;&#x706B;&#x66DC;&#x65E5;&lt;/b&gt;</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="5_%5Bru_men%5DF-Script_konsoru_wo_shittemiru_files/shapeimage_3.png" left="0px" top="0px" width="627px" height="298px"/>
</content>
