<?xml version="1.0"?>
<content collectionGUID="84341F66-B8FE-4E3D-8495-6E0E0E951A48">
  <lastEdited clientType="local-build-20130630" date="2013-06-30 23:13:03 +0900"/>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;&#xFF3B;&#x5165;&#x9580;&#xFF3D;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x3092;&#x8868;&#x793A;&#x3057;&#x3066;&#x3001;&#x305D;&#x306E;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x5909;&#x3048;&#x308B;&lt;/b&gt;</richText>
  </textBox>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;&#x25A0; &#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x3092;&#x4E00;&#x3064;&#x5275;&#x3063;&#x3066;&#x8868;&#x793A;&#x3059;&#x308B;&#xD;&lt;/b&gt;&#xD;F-Script.app &#x3092;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3001;F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x5165;&#x529B;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002;&#xD;&#x307E;&#x305A;&#x3001;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x3092;&#x4E00;&#x3064;&#x5275;&#x308B;&#xFF1A;&#xD;&#xD;    &gt; aWin := NSWindow alloc initWithContentRect: (100&lt;&gt;100 extent:300&lt;&gt;200) &#xD;                                           styleMask: NSTitledWindowMask+NSClosableWindowMask&#xD;                                           backing: NSBackingStoreBuffered                                    &#xD;                                           defer: NO                                                                        &#xD;&#xD;&#x3053;&#x308C;&#x3067;&#x3001;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x304C;&#x3067;&#x304D;&#x3066;&#x3001;&#x5909;&#x6570; aWin &#x306B;&#x4EE3;&#x5165;&#xFF08;&#x675F;&#x7E1B;&#xFF09;&#x3055;&#x308C;&#x305F;&#x3002;&#xD;&#xD;&#x4E0A;&#x8A18;&#x306E;&#x6587;&#x306F;&#x3001;&#x672C;&#x6765;&#x3001;&#x4E00;&#x884C;&#x306B;&#x66F8;&#x304B;&#x308C;&#x308B;&#x3079;&#x304D;&#x5185;&#x5BB9;&#x3060;&#x304C;&#x3001;&#x4EFB;&#x610F;&#x306E;&#x533A;&#x5207;&#x308A;&#x7B87;&#x6240;&#x3067;&#x6539;&#x884C;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&#x305D;&#x306E;&#x5834;&#x5408;&#x3001;&#x300C;return&#x300D;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3059;&#x3068;&#x300C;&#x5B9F;&#x884C;&#x300D;&#x3068;&#x89E3;&#x91C8;&#x3055;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x306E;&#x3067;&#x6CE8;&#x610F;&#x3057;&#x3088;&#x3046;&#x3002;&#x5B9F;&#x884C;&#x305B;&#x305A;&#x306B;&#x300C;&#x6539;&#x884C;&#x300D;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x300C;Ctrl&#x300D;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089;&#x300C;return&#x300D;&#x3092;&#x62BC;&#x3059;&#x3002;&#x6700;&#x5F8C;&#x306E; ... defer: NO &#x306E;&#x5F8C;&#x3060;&#x3051;&#x306F;&#x3001;&#x300C;&#x5B9F;&#x884C;&#x300D;&#x306E;&#x300C;return&#x300D;&#x3060;&#x3002;&#xD;&#x307E;&#x305F;&#x3001;&#x8AAD;&#x307F;&#x6613;&#x304F;&#x3059;&#x308B;&#x70BA;&#x306E;&#x7A7A;&#x767D;&#x306F;&#x4EFB;&#x610F;&#x306E;&#x6570;&#x3060;&#x3051;&#x5165;&#x529B;&#x3057;&#x3066;&#x3088;&#x3044;&#x3002;&#xD;&#xD;&#x3053;&#x308C;&#x3092;&#x753B;&#x9762;&#x306B;&#x8868;&#x793A;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x3053;&#x306E;&#x5909;&#x6570; aWin &#x306B;&#x4EE5;&#x4E0B;&#x306E;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x9001;&#x308B;&#xFF1A;&#xD;&#xD;    &gt; aWin orderFront: nil&#xD;&#xD;&#x3053;&#x308C;&#x3067;&#x3001;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x304C;&#x4E00;&#x3064;&#x753B;&#x9762;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x306F;&#x305A;&#x3060;&#x3002;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x5909;&#x3048;&#x308B;&#xD;&lt;/b&gt;&#xD;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x5168;&#x4F53;&#x306E;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x5909;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#xFF1A;&#xD;&#xD;    &gt; aWin setAlphaValue: 0.5&#xD;&#xD;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8; setAlphaValue: &#x306B;&#x306F;&#x3001;&#x5F15;&#x6570;&#x3068;&#x3057;&#x3066;&#x3001;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x8868;&#x3059; 0.0 ~ 1.0 &#x306E;&#x5024;&#x3092;&#x6E21;&#x3059;&#x3002;0.0 &#x3067;&#x5B8C;&#x5168;&#x306B;&#x900F;&#x660E;&#x306B;&#x306A;&#x308A;&#x3001;1.0 &#x3067;&#x5B8C;&#x5168;&#x306B;&#x4E0D;&#x900F;&#x660E;&#x306B;&#x306A;&#x308B;&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x5024;&#x306F; 1.0&#xFF08;&#x5B8C;&#x5168;&#x306A;&#x4E0D;&#x900F;&#x660E;&#xFF09;&#x3060;&#x3002;&#xD;&#xD;&#x3064;&#x3044;&#x3067;&#x306B;&#x3001;&#x3053;&#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x30D0;&#x30FC;&#x306B;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3082;&#x8A2D;&#x5B9A;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#xFF1A;&#xD;&#xD;    &gt; aWin setTitle: '&#x521D;&#x3081;&#x3066;&#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;'&#xD;&#xD;&#x524D;&#x56DE;&#x306E;&#x8A18;&#x4E8B;&#x306B;&#x3082;&#x66F8;&#x3044;&#x305F;&#x3088;&#x3046;&#x306B;&#x3001;F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;&#x5165;&#x529B;&#x4E2D;&#x306B;&#x65E5;&#x672C;&#x8A9E;&#x5909;&#x63DB;&#x3092;&#x884C;&#x3046;&#x3068;&#x3001;&#x305D;&#x306E;&#x78BA;&#x5B9A;&#x64CD;&#x4F5C;&#x306E;&#x300C;&#x6539;&#x884C;&#x300D;&#x304C;&#x3001;&#x300C;&#x5B9F;&#x884C;&#x300D;&#x3068;&#x89E3;&#x91C8;&#x3055;&#x308C;&#x3066;&#x3057;&#x307E;&#x3044;&#x3001;&#x3046;&#x307E;&#x304F;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x3057;&#x304B;&#x3057;&#x4E8B;&#x524D;&#x306B;&#x3001;&#x5225;&#x306E;&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x7B49;&#x3067;&#x5165;&#x529B;&#x3059;&#x308B;&#x65E5;&#x672C;&#x8A9E;&#x6587;&#x5B57;&#x5217;&#x3092;&#x7528;&#x610F;&#x3057;&#x3066;&#x304A;&#x304D;&#x3001;&#x305D;&#x308C;&#x3092;&#x30B3;&#x30D4;&#x30DA;&#x3059;&#x308B;&#x5206;&#x306B;&#x306F;&#x554F;&#x984C;&#x306F;&#x306A;&#x3044;&#x3002;&#x4ECA;&#x56DE;&#x306F;&#x3001;&#x4E0A;&#x8A18;&#x306E;&#x884C;&#x3092;&#x305D;&#x306E;&#x307E;&#x307E;&#x30B3;&#x30D4;&#x30DA;&#x3059;&#x308B;&#x3068;&#x826F;&#x3044;&#x3002;&#xD; &#xD;&lt;b&gt;&#x25A0; &#x4F55;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF1A;&#x6587;&#x6CD5;&#x7684;&#x306A;&#x89E3;&#x8AAC;&#xD;&lt;/b&gt;&#xD;&#x3053;&#x3093;&#x306A;&#x77ED;&#x3044;&#x30B3;&#x30FC;&#x30C9;&#x3067;&#x3082;&#x3001;&#x5B66;&#x3079;&#x308B;&#x3053;&#x3068;&#x304C;&#x305F;&#x304F;&#x3055;&#x3093;&#x3042;&#x308B;&#x3002;&#xD;&#x3053;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306F;&#x3001;&#x5168;&#x4F53;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;Cocoa &#x304C;&#x63D0;&#x4F9B;&#x3059;&#x308B; ApplicationKit.framework &#x3067;&#x5B9A;&#x7FA9;&#x3055;&#x308C;&#x305F; NSWindow &#x30AF;&#x30E9;&#x30B9;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x3092;&#x4E00;&#x3064;&#x5275;&#x308A;&#x3001;&#x305D;&#x308C;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x81EA;&#x5206;&#x81EA;&#x8EAB;&#x3092;&#x753B;&#x9762;&#x306B;&#x8868;&#x793A;&#x3055;&#x305B;&#x308B;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x9001;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x305D;&#x306E;&#x5F8C;&#x3067;&#x3001;&#x3055;&#x3089;&#x306B;&#x3001;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3084;&#x3001;&#x900F;&#x660E;&#x5EA6;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3082;&#x9001;&#x3063;&#x305F;&#x3002;&#x3053;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x304C;&#x3084;&#x3063;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x3001;&#x5C11;&#x3057;&#x8E0F;&#x307F;&#x8FBC;&#x3093;&#x3067;&#x898B;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002;Objective-C &#x3068;&#x306E;&#x9055;&#x3044;&#x306B;&#x7126;&#x70B9;&#x3092;&#x5F53;&#x3066;&#x3066;&#x307F;&#x308B;&#x3002;&#xD;&#xD;Objective-C &#x3068;&#x306E;&#x5BFE;&#x6BD4;&#x3067;&#x898B;&#x305F;&#x5834;&#x5408;&#x3001;&#x6587;&#x6CD5;&#x4E0A;&#x306E;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x306F;&#x6B21;&#x306E;&#x901A;&#x308A;&#x3002;&#xD;&#xD;    &#x30FB;#import &lt;Foundation/Foundation.h&gt; #import &lt;AppKit/AppKit.h&gt; &#x7B49;&#x306E;&#x5BA3;&#x8A00;&#x306F;&#x4E0D;&#x8981;&#xD;    &#x30FB;&#x5404; Cocoa &#x30AF;&#x30E9;&#x30B9;&#x3067;&#x5B9A;&#x7FA9;&#x3055;&#x308C;&#x305F;&#x5404;&#x7A2E; Cocoa &#x5B9A;&#x6570;&#x304C;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x3048;&#x308B;&#xD;    &#x30FB;&#x5909;&#x6570;&#x3068;&#x4EE3;&#x5165;&#xD;    &#x30FB;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x5F0F;&#x306B;&#xFF3B;&#xFF3D;&#x306F;&#x4E0D;&#x8981;&#xD;    &#x30FB;&#x5168;&#x3066;&#x306E; Cocoa &#x30AF;&#x30E9;&#x30B9;&#x3068;&#x305D;&#x308C;&#x3089;&#x306E;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306F;&#xFF08;&#x307B;&#x307C;&#x5168;&#x3066;&#xFF09;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x3048;&#x308B;&#xD;&#xD;&#x4EE5;&#x4E0B;&#x306B;&#x4E00;&#x3064;&#x305A;&#x3064;&#x8AAC;&#x660E;&#x3057;&#x3088;&#x3046;&#x3002;&#xD;&#xD;&lt;b&gt;&#xFF11;&#xFF09;#import &lt;Foundation/Foundation.h&gt;&#x3001;#import &lt;AppKit/AppKit.h&gt; &#x7B49;&#x306E;&#x5BA3;&#x8A00;&#x306F;&#x4E0D;&#x8981;&#xD;&lt;/b&gt;&#xD;F-Script.app &#x306F;&#x4E00;&#x3064;&#x306E; Cocoa &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3042;&#x308A;&#x3001;&#x8D77;&#x52D5;&#x6642;&#x306B;&#xFF14;&#xFF10;&#x500B;&#x3082;&#x306E; Cocoa &#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x30EA;&#x30F3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x305D;&#x308C;&#x305E;&#x308C;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30D8;&#x30C3;&#x30C0;&#x30FC;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x65E2;&#x306B; #import &#x3057;&#x3066;&#x3044;&#x308B;&#x3002; F-Script.app &#x5185;&#x90E8;&#x306E; F-Script &#x30A4;&#x30F3;&#x30BF;&#x30D7;&#x30EA;&#x30BF;&#x306F;&#x3001;&#x3053;&#x308C;&#x3089;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3068;&#x30D8;&#x30C3;&#x30C0;&#x30FC;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x3042;&#x308B;&#x5404;&#x7A2E;&#x5B9A;&#x7FA9;&#x306B;&#x5E38;&#x6642;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3067;&#x304D;&#x308B;&#x306E;&#x3060;&#x3002;&#xD;&#x5F93;&#x3063;&#x3066;&#x3001;F-Script &#x3067;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x66F8;&#x304F;&#x969B;&#x306F;&#x3001;&#x3053;&#x308C;&#x3089;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3084;&#x30D8;&#x30C3;&#x30C0;&#x30FC;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x6539;&#x3081;&#x3066;&#x8AAD;&#x307F;&#x8FBC;&#x3080;&#x5FC5;&#x8981;&#x306F;&#x306A;&#x3044;&#x3002;&#xD;&#xD;&#x8D77;&#x52D5;&#x6642;&#x306B;&#x8AAD;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x308B;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x306B;&#x306F;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;&#x3001;&#x305D;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x304C; &#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB; 7. &lt;a href="http://hid2718.github.com/FScript/AccessingMacOSXFrameworksWithFScript-index-ja.html"&gt;F-Script &#x3067; Mac OS X &#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x7FA4;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&lt;/a&gt; &#x306B;&#x63B2;&#x8F09;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;&#x3053;&#x308C;&#x3089;&#x306F; Cocoa &#x306E;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x81A8;&#x5927;&#x306A;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x3054;&#x304F;&#x4E00;&#x90E8;&#x306B;&#x904E;&#x304E;&#x306A;&#x3044;&#x3002;&#x3053;&#x308C;&#x4EE5;&#x5916;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x5229;&#x7528;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x660E;&#x793A;&#x7684;&#x306B;&#x305D;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x8AAD;&#x307F;&#x8FBC;&#x3080;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;&#x540C;&#x3058;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306B;&#x3001;&#x305D;&#x306E;&#x8AAD;&#x307F;&#x8FBC;&#x307F;&#x65B9;&#x6CD5;&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x5177;&#x4F53;&#x7684;&#x306A;&#x8AAC;&#x660E;&#x304C;&#x3042;&#x308B;&#x3002;&#xD;&#xD;&lt;b&gt;&#xFF12;&#xFF09;&#x5404; Cocoa &#x30AF;&#x30E9;&#x30B9;&#x3067;&#x5B9A;&#x7FA9;&#x3055;&#x308C;&#x305F;&#x5404;&#x7A2E; Cocoa &#x5B9A;&#x6570;&#x304C;&#x3001;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x3048;&#x308B;&lt;/b&gt;&#xD;&#xD;&#x4E0A;&#x8A18;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306B;&#x300C; NSTitledWindowMask&#x300D;&#x3084;&#x300C;NSClosableWindowMask&#x300D;&#x7B49;&#x306E; Cocoa &#x5B9A;&#x6570;&#x3092;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x3048;&#x308B;&#x306E;&#x3082;&#x540C;&#x3058;&#x7406;&#x7531;&#x306B;&#x3088;&#x308B;&#x3002;&#x3053;&#x308C;&#x3089;&#x306E;&#x5B9A;&#x6570;&#x306F;&#x3001;&#x8AAD;&#x8FBC;&#x6E08;&#x307F;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x30D8;&#x30C3;&#x30C0;&#x30FC;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x5185;&#x90E8;&#x3067;&#x5B9A;&#x7FA9;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#xD;&#xD;&lt;b&gt;&#xFF13;&#xFF09;&#x5909;&#x6570;&#x3068;&#x4EE3;&#x5165;&#xFF1A; aWin := ...&#xD;&lt;/b&gt;&#xD;F-Script &#x3067;&#x306F;&#x3001;&#x7279;&#x5225;&#x306A;&#x578B;&#x6307;&#x5B9A;&#x3092;&#x3057;&#x306A;&#x3044;&#x9650;&#x308A;&#x3001;&#x5909;&#x6570;&#x306F;&#x5168;&#x3066;&#x300C;id &#x578B;&#x300D;&#x3067;&#x3001;&#x5BA3;&#x8A00;&#x7121;&#x3057;&#x3067;&#x3044;&#x304D;&#x306A;&#x308A;&#x4F7F;&#x3048;&#x308B;&#x3002;&#x307E;&#x305F;&#x3001;&#x4EE3;&#x5165;&#x306F;&#x3001;&#x300C;=&#x300D;&#x3067;&#x306F;&#x306A;&#x304F;&#x300C;:=&#x300D;&#x3067;&#x8868;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306F; Smalltalk &#x3068;&#x540C;&#x3058;&#x3060;&#x3002;&#xD;&#xD;&#x305F;&#x3060;&#x3057;&#x3001;F-Script &#x306F; Objective-C &#x3068;&#x5168;&#x304F;&#x540C;&#x69D8;&#x306B;&#x300C;Objective-C &#x30E9;&#x30F3;&#x30BF;&#x30A4;&#x30E0;&#x300D;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x52D5;&#x3044;&#x3066;&#x3044;&#x308B;&#x70BA;&#x3001;Objective-C &#x3067;&#x66F8;&#x304B;&#x308C;&#x305F;&#x5404;&#x7A2E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3068;&#x306E;&#x9063;&#x308A;&#x53D6;&#x308A;&#x304C;&#x5FC5;&#x8981;&#x306A;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x969B;&#x306B;&#x306F;&#x3001;Objective-C &#x3068;&#x306E;&#x30DE;&#x30C3;&#x30D4;&#x30F3;&#x30B0;&#x306E;&#x70BA;&#x306B;&#x660E;&#x793A;&#x7684;&#x306A;&#x578B;&#x6307;&#x5B9A;&#x304C;&#x5FC5;&#x8981;&#x306B;&#x306A;&#x308B;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;NSView &#x30AF;&#x30E9;&#x30B9;&#x3092;&#x7D99;&#x627F;&#x3057;&#x3066;&#x72EC;&#x81EA;&#x30AF;&#x30E9;&#x30B9;&#x3092;&#x4F5C;&#x308B;&#x5834;&#x5408;&#x304C;&#x305D;&#x3046;&#x3060;&#x3002;&#x305D;&#x306E;&#x518D;&#x63CF;&#x753B;&#x3092;&#x53F8;&#x308B;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x3067;&#x3042;&#x308B;&#x300C;drawRect:&#x300D;&#x5468;&#x308A;&#x306F;&#x3001;&#x3053;&#x308C;&#x304C;&#x3001;Objective-C &#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x304B;&#x3089;&#x30B3;&#x30FC;&#x30EB;&#x30D0;&#x30C3;&#x30AF;&#x3055;&#x308C;&#x308B;&#x70BA;&#x3001;&#x5F15;&#x6570;&#x3001;&#x623B;&#x308A;&#x5024;&#x5171;&#x306B;&#x3001;&#x660E;&#x793A;&#x7684;&#x306A;&#x578B;&#x6307;&#x5B9A;&#x304C;&#x5FC5;&#x8981;&#x3068;&#x306A;&#x308B;&#x3002;&#xD;&#x3053;&#x306E;&#x70B9;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3001;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB; 4. &lt;a href="http://hid2718.github.io/FScript/CreatingCocoaClassesWithFScript-index-ja.html"&gt;F-Script &#x3067; Cocoa &#x30AF;&#x30E9;&#x30B9;&#x3092;&#x5275;&#x308B;&lt;/a&gt; &#x306E;&#x300C;&#x3055;&#x3089;&#x306B;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306B;&#x3064;&#x3044;&#x3066;&#x300D;&#x306E;&#x7BC0;&#x306B;&#x8A73;&#x3057;&#x3044;&#x89E3;&#x8AAC;&#x304C;&#x3042;&#x308B;&#x3002;&#x307E;&#x305F;&#x3001;F-Script Guide &#x306E; &lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html#mozTocId433866"&gt;15 Objective-C &#x30DE;&#x30C3;&#x30D4;&#x30F3;&#x30B0; &#x306E;&#x7BC0;&lt;/a&gt; &#x3082;&#x5408;&#x308F;&#x305B;&#x3066;&#x53C2;&#x7167;&#x3059;&#x308B;&#x3068;&#x3088;&#x3044;&#x3002;&#xD;&#xD;&lt;b&gt;&#xFF14;&#xFF09;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x5F0F;&#x306B;&#xFF3B;&#xFF3D;&#x306F;&#x4E0D;&#x8981;&#xFF1A; NSWindow alloc initWithContentRect: ...&#xD;&lt;/b&gt;&#xD;Objective-C &#x3067;&#x306F;&#x300C;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x5F0F;&#x300D;&#x306F;&#xFF3B;&#xFF3D;&#x3067;&#x62EC;&#x3063;&#x3066;&#x8868;&#x3057;&#x3001;&#x666E;&#x901A;&#x306E;C&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x3068;&#x306F;&#x5206;&#x96E2;&#x3057;&#x3066;&#x6271;&#x308F;&#x308C;&#x308B;&#x304C;&#x3001;F-Script &#x3067;&#x306F;&#x3001;Smalltalk &#x3068;&#x540C;&#x69D8;&#x300C;&#x5168;&#x3066;&#x304C;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x5F0F;&#x300D;&#x3067;&#x3042;&#x308A;&#x3001;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x5F0F;&#x306B;&#xFF3B;&#xFF3D;&#x306F;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x3002;&#xD;Objective-C &#x3067; [ [ Object message1 ] message2 ] &#x3068;&#x3044;&#x3046;&#x5F0F;&#x306F;&#x3001;&#x5358;&#x306B; Object message1 message2 &#x3068;&#x306A;&#x308B;&#x3002;&#xD;&#xD;&lt;b&gt;&#xFF15;&#xFF09;&#x5168;&#x3066;&#x306E; Cocoa &#x30AF;&#x30E9;&#x30B9;&#x3068;&#x305D;&#x308C;&#x3089;&#x306E;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306F;&#xFF08;&#x307B;&#x307C;&#x5168;&#x3066;&#xFF09;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x3048;&#x308B;&#xD;&lt;/b&gt;&#xD;F-Script &#x306F;&#x3001;&#x305D;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30D7;&#x30EA;&#x30BF;&#x3092;&#x901A;&#x3057;&#x3066; Objective-C &#x306E;&#x30E9;&#x30F3;&#x30BF;&#x30A4;&#x30E0;&#x3092;&#x4F7F;&#x3063;&#x3066; Cocoa &#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x3002;&#x305D;&#x306E;&#x70BA;&#x3001;Cocoa &#x304B;&#x3089;&#x898B;&#x308B;&#x3068;&#x3001;&#x305D;&#x306E;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x304C; Objective-C &#x304B;&#x3089;&#x306E;&#x3082;&#x306E;&#x306A;&#x306E;&#x304B; F-Script &#x304B;&#x3089;&#x306E;&#x3082;&#x306E;&#x306A;&#x306E;&#x304B;&#x533A;&#x5225;&#x304C;&#x3064;&#x304B;&#x306A;&#x3044;&#x3002;&#xD;&#x3064;&#x307E;&#x308A;&#x3001;F-Script &#x306F;&#x3001;Objective-C &#x3067;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x306A; Cocoa &#x306E;&#x6A5F;&#x80FD;&#x3092;&#xFF08;&#x307B;&#x307C;&#x5168;&#x3066;&#xFF09;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x3048;&#x308B;&#x3068;&#x8003;&#x3048;&#x3066;&#x826F;&#x3044;&#x3002;&#xD;&#xD;&#x203B; &#x4F46;&#x3057;&#x3001;F-Script &#x30A4;&#x30F3;&#x30BF;&#x30D7;&#x30EA;&#x30BF;&#x306F; &#x7D14;&#x7C8B;&#x306B; Smalltalk &#x306E;&#x4ED5;&#x69D8;&#x306B;&#x6CBF;&#x3063;&#x3066;&#x4F5C;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x70BA;&#x3001;&#x305D;&#x308C;&#x304C; Smalltalk &#x7684;&#x306B;&#x898B;&#x308B;&#x3068;&#x300C;&#x5909;&#x306A;&#x300D;&#x69CB;&#x6587;&#x3067;&#x3042;&#x308B;&#x304C;&#x6545;&#x306B; F-Script &#x304B;&#x3089;&#x306F;&#x5229;&#x7528;&#x3067;&#x304D;&#x306A;&#x3044;&#x3001;&#x3068;&#x3044;&#x3046;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x304C;&#x4E00;&#x90E8;&#x5B58;&#x5728;&#x3059;&#x308B;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;NSArray &#x30AF;&#x30E9;&#x30B9;&#x306E;&#x30AF;&#x30E9;&#x30B9;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x300C;arrayWithObjects:&#x300D;&#x306F;&#x3001;&#x305D;&#x306E;&#x4E00;&#x4F8B;&#x3067;&#x3042;&#x308B;&#x3002;&#x3053;&#x306E;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306E;&#x4ED5;&#x69D8;&#x306F;&#x3001;&#x305D;&#x306E;&#x5F15;&#x6570;&#xFF08;: &#x306E;&#x5F8C;&#x308D;&#xFF09;&#x306B; &#x8907;&#x6570;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x300C;,&#x300D;&#x3067;&#x533A;&#x5207;&#x3063;&#x3066;&#x8907;&#x6570;&#x4E26;&#x3079;&#x3066;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3001;&#x3068;&#x3044;&#x3046;&#x3082;&#x306E;&#x3060;&#x304C;&#x3001;Smalltalk &#x3067;&#x306F;&#x3001;&#x3053;&#x3046;&#x3057;&#x305F;&#x5F15;&#x6570;&#x306E;&#x4ED5;&#x69D8;&#x306F;&#x3042;&#x308A;&#x5F97;&#x306A;&#x3044;&#x3002;Smalltalk &#x3067;&#x306F;&#x3001;&#x3053;&#x3046;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x5F15;&#x6570;&#x3092;&#x300C;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x914D;&#x5217;&#x300D;&#x3068;&#x3057;&#x3066;&#x3001;&#x3042;&#x304F;&#x307E;&#x3067;&#x3082;&#x4E00;&#x3064;&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3068;&#x3057;&#x3066;&#x6E21;&#x3059;&#x3088;&#x3046;&#x306A;&#x4ED5;&#x69D8;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#xD;&#xD;</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;2013&#x5E74;2&#x6708;9&#x65E5;&#x571F;&#x66DC;&#x65E5;&lt;/b&gt;</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="9_%5Bru_men%5Du%7Eindouwo_yitsu_biao_shishitemiyou_files/shapeimage_3.png" left="0px" top="0px" width="626px" height="301px"/>
</content>
