<?xml version="1.0"?>
<content collectionGUID="84341F66-B8FE-4E3D-8495-6E0E0E951A48">
  <lastEdited clientType="local-build-20130525" date="2013-05-25 22:10:19 +0900"/>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;Mountain Lion &#x5BFE;&#x5FDC;: F-Script &#x4E0D;&#x5177;&#x5408;&#x306E;&#x539F;&#x56E0;&#x3068;&#x5BFE;&#x7B56;&lt;/b&gt;</richText>
  </textBox>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>F-Script &#x306E;&#x6700;&#x65B0;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3; 2.1 &#x306B;&#x306F;&#x3001;Mac OS X 10.8&#xFF08;Mountain Lion&#xFF09;&#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3068;&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3059;&#x308B;&#x3001;&#x3068;&#x3044;&#x3046;&#x4E0D;&#x5177;&#x5408;&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x304C;&#x5831;&#x544A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#xD;&#x5F53;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x306F;&#x3001;&#x516C;&#x5F0F;&#x30B5;&#x30A4;&#x30C8;&#x304B;&#x3089;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x305F;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3; 2.1 &#x306E; ZIP &#x306B;&#x540C;&#x68B1;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4FEE;&#x6B63;&#xFF06;&#x30EA;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x3001;&#x554F;&#x984C;&#x306E;&#x5BFE;&#x7B56;&#x7248;&#x3092;&#x72EC;&#x81EA;&#x306B;&#x914D;&#x5E03;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000; &#x2192; &lt;b&gt;&lt;a href="https://dl.dropbox.com/u/11990037/F-Script20100614-Rebuild-for-Mountain-Lion-by-hid2718-20130114.zip"&gt;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x306F;&#x3053;&#x3061;&#x3089;&#x304B;&#x3089;&lt;/a&gt;&lt;/b&gt;&#xD;&#x4EE5;&#x4E0B;&#x306B;&#x3001;&#x305D;&#x306E;&#x5BFE;&#x7B56;&#x306E;&#x6539;&#x4FEE;&#x624B;&#x9806;&#x306B;&#x3064;&#x3044;&#x3066;&#x8A18;&#x9332;&#x3057;&#x3066;&#x304A;&#x304F;&#x3002;&#xD;&#x203B; &#x3053;&#x306E;&#x8A18;&#x4E8B;&#x306E;&#x4F5C;&#x696D;&#x74B0;&#x5883;&#xFF1A;Mac OS X 10.6.8 Snow Leopard &#xFF0F; Xcode 3.2.6&#xD;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x539F;&#x56E0;&#xD;&lt;/b&gt;&#xD;F-Script &#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x8A18;&#x4E8B;&#x306E;&#x4E00;&#x3064;&#x300C;&lt;a href="http://hid2718.github.com/FScript/AccessingMacOSXFrameworksWithFScript-index-ja.html"&gt;F-Script &#x3067; Mac OS X &#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x7FA4;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&lt;/a&gt;&#x300D;&#x306B;&#x3082;&#x8AAC;&#x660E;&#x304C;&#x3042;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001;F-Script &#x306F;&#x3001;&#x8D77;&#x52D5;&#x6642;&#x306B;40&#x500B;&#x3082;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x81EA;&#x52D5;&#x30EA;&#x30F3;&#x30AF;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#xD;&#x3053;&#x306E;&#x4E2D;&#x306B;&#x306F;&#x3001;F-Script &#x81EA;&#x8EAB;&#x306E;&#x52D5;&#x4F5C;&#x306E;&#x70BA;&#x306B;&#x3082;&#x5FC5;&#x8981;&#x306A;&#x3082;&#x306E;&#xFF08;Foundation Kit &#x3084; Application Kit &#x306A;&#x3069;&#xFF09;&#x3082;&#x5F53;&#x7136;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x305D;&#x306E;&#x307B;&#x3068;&#x3093;&#x3069;&#x306F;&#x3001;&#x4E8B;&#x524D;&#x4F5C;&#x696D;&#x7121;&#x3057;&#x3067;&#x305D;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x304C;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x5229;&#x4FBF;&#x3092;&#x56F3;&#x308B;&#x76EE;&#x7684;&#x3067;&#x30EA;&#x30F3;&#x30AF;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3082;&#x306E;&#x3060;&#x3002;&#xD;&#x4ECA;&#x56DE;&#x306E;&#x4E0D;&#x5177;&#x5408;&#x306F;&#x3001;&#x3053;&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x5229;&#x4FBF;&#x3092;&#x56F3;&#x308B;&#x76EE;&#x7684;&#x3067;&#x8D77;&#x52D5;&#x6642;&#x306B;&#x81EA;&#x52D5;&#x30EA;&#x30F3;&#x30AF;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x4E00;&#x3064;&#x300C;XgridFoundation&#x300D;&#x304C;&#x3001;Mountain Lion &#x3067;&#x306F;&#x5EC3;&#x6B62;&#x3055;&#x308C;&#x305F;&#x3053;&#x3068;&#x304C;&#x300C;&#x539F;&#x56E0;&#x300D;&#x3067;&#x3042;&#x308B;&#x3002;&#xD;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x5BFE;&#x7B56;&#x65B9;&#x91DD;&#xD;&lt;/b&gt;&#xD;ML &#x3067;&#x5EC3;&#x6B62;&#x3055;&#x308C;&#x305F;&#x300C;XgridFoundation&#x300D;&#x306F;&#x3001;F-Script &#x81EA;&#x4F53;&#x306E;&#x52D5;&#x4F5C;&#x306B;&#x306F;&#x95A2;&#x4E0E;&#x3057;&#x306A;&#x3044;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3067;&#x3042;&#x308B;&#x70BA;&#x3001;&#x5358;&#x306B;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x69CB;&#x6210;&#x304B;&#x3089;&#x3053;&#x308C;&#x3092;&#x524A;&#x9664;&#x3057;&#x3066;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x76F4;&#x3059;&#x3001;&#x3068;&#x3044;&#x3046;&#x65B9;&#x91DD;&#x3067;&#x6539;&#x4FEE;&#x3092;&#x884C;&#x3063;&#x305F;&#x3002;&#xD;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x6539;&#x4FEE;&#x624B;&#x9806;&#xD;&lt;/b&gt;&#xD;&#xFF11;&#xFF09;&#x516C;&#x5F0F;&#x30B5;&#x30A4;&#x30C8;&#x304B;&#x3089;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x3066;&#x89E3;&#x51CD;&#x3057;&#x305F;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x300C;source&#x300D;&#x76F4;&#x4E0B;&#xD;&#x3000;&#x306B;&#x3042;&#x308B;&#x300C;FScript.xcodeproj&#x300D;&#x3092; Xcode &#x3067;&#x958B;&#x304F;&#x3002;&#xD;&#xD;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#xD;&#xD;&#xFF12;&#xFF09;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x691C;&#x7D22;&#x300D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x3057;&#x3001;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x5185;&#x300D;&#x3092;&#x5BFE;&#x8C61;&#x306B;&#xD;&#x3000;&#x691C;&#x7D22;&#x6587;&#x5B57;&#x5217;&#xFF1A;&#x300C; XgridFoundation&#x300D;&#x3068;&#x5165;&#x529B;&#x3057;&#x3066;&#x691C;&#x7D22;&#x3059;&#x308B;&#x3002;&#xD;&#x3000;&#x3053;&#x306E;&#x6587;&#x5B57;&#x5217;&#x3092;&#x542B;&#x3080;&#x7B87;&#x6240;&#x304C;&#x3001;&#xFF13;&#x30AB;&#x6240;&#x898B;&#x3064;&#x304B;&#x3063;&#x305F;&#x3002;&#xD;&#xD;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#xD;&#xD;&#xFF13;&#xFF09;FSConstantsDictionaryGenerator.m &#x306E;&#x4EE5;&#x4E0B;&#x3092;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x30A2;&#x30A6;&#x30C8;&#x3002;&#x4FDD;&#x5B58;&#x3002;&#xD;&#x3000;#import &lt;XgridFoundation/XgridFoundation.h&gt;&#xD;&#x3000;&#x3000;&#x2193;&#xD;&#x3000;// #import &lt;XgridFoundation/XgridFoundation.h&gt;&#xD;&#x3000;&#x3082;&#x3046;&#x4E00;&#x3064;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x8A72;&#x5F53;&#x7B87;&#x6240;&#x306F;&#x3001;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x6587;&#x306E;&#x70BA;&#x3001;&#x305D;&#x306E;&#x307E;&#x307E;&#x3068;&#x3059;&#x308B;&#x3002;&#xD;&#xD;&#xFF14;&#xFF09; Xcode &#x306E;&#x5DE6;&#x5074;&#x300C;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x3068;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x300D;&#x30DA;&#x30A4;&#x30F3;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B; &#x5404;&#x7A2E;&#xD;&#x3000;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x7FA4;&#x306E;&#x6700;&#x5F8C;&#x306B;&#x3042;&#x308B;&#x300C; XgridFoundation.framework&#x300D;&#x306E;&#x4E0A;&#x3067;&#xD;&#x3000;&#x53F3;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x300C;&#x524A;&#x9664;&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3078;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x3092;&#x5916;&#x3059;&#x3002;&#xD;&#xD;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#xD;&#xD;&#xFF15;&#xFF09;Xcode &#x30E1;&#x30CB;&#x30E5;&#x30FC;&#xFF1A;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#xFF1E;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x3092;&#x8A2D;&#x5B9A;&#x300D;&#xD;&#x3000;&#x3067;&#x300C;F-Script&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&#xD;&#xD;&#xFF16;&#xFF09; Xcode &#x30E1;&#x30CB;&#x30E5;&#x30FC;&#xFF1A;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#xFF1E;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30D3;&#x30EB;&#x30C9;&#x69CB;&#x6210;&#x3092;&#x8A2D;&#x5B9A;&#x300D;&#xD;&#x3000;&#x3067;&#x300C;Deployment&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&#xD;&#xD;&#xFF17;&#xFF09; Xcode &#x30E1;&#x30CB;&#x30E5;&#x30FC;&#xFF1A;&#x300C;&#x30D3;&#x30EB;&#x30C9;&#xFF1E;&#x30D3;&#x30EB;&#x30C9;&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&#xD;&#x3000;&#x30D3;&#x30EB;&#x30C9;&#x304C;&#x5B8C;&#x4E86;&#x3059;&#x308B;&#x3068;&#x3001;&#x89E3;&#x51CD;&#x3057;&#x305F;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x4E2D;&#x306E;&#x300C;source / build&#x300D;&#x306E;&#x4E0B;&#xD;&#x3000;&#x306B;&#x300C;Deployment&#x300D;&#x3068;&#x3044;&#x3046;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x304C;&#x3067;&#x304D;&#x3001;&#x305D;&#x306E;&#x4E2D;&#x306B;&#x4ECA;&#x56DE;&#x306E;&#x30D3;&#x30EB;&#x30C9;&#x7D50;&#x679C;&#xD;&#x3000;&#x3067;&#x3042;&#x308B;&#x300C;F-Script.app&#x300D;&#x304C;&#x751F;&#x6210;&#x3055;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;&#x3053;&#x308C;&#x3092;&#x3001;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x76F4;&#x4E0B;&#x306B;&#xD;&#x3000;&#x30B3;&#x30D4;&#x30FC;&#x3057;&#x3066;&#x3001;&#x4ECA;&#x56DE;&#x306E;&#x6539;&#x4FEE;&#x4F5C;&#x696D;&#x306F;&#x7D42;&#x4E86;&#x3002;&#xD;&#xD;&#xD;&lt;b&gt;&#x25A0; &#x52D5;&#x4F5C;&#x78BA;&#x8A8D;&#xD;&lt;/b&gt;&#xD;&#xFF18;&#xFF09;&#x4ECA;&#x56DE;&#x306E;&#x6539;&#x4FEE;&#x7D50;&#x679C;&#x3092; Mountain Lion &#x74B0;&#x5883;&#x4E0B;&#x3067;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3001;&#x7121;&#x4E8B;&#x306B;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#xD;&#x3000;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3001;&#x3054;&#x9023;&#x7D61;&#x3092;&#x4E0B;&#x3055;&#x3063;&#x305F; &lt;a href="https://twitter.com/kuritar"&gt;@kuritar&lt;/a&gt; &#x3055;&#x3093;&#x306B;&#x6DF1;&#x304F;&#x611F;&#x8B1D;&#x81F4;&#x3057;&#x307E;&#x3059;&#x3002;&#xD;&#x3000;&#x3042;&#x308A;&#x304C;&#x3068;&#x3046;&#x3054;&#x3056;&#x3044;&#x307E;&#x3057;&#x305F;&#xFF01;&#xD;&#xD;                                                                                                  </richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>&lt;b&gt;2013&#x5E74;1&#x6708;20&#x65E5;&#x65E5;&#x66DC;&#x65E5;&lt;/b&gt;</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="20_Mountain_Lion_dui_ying__F-Script_bu_ju_heno_yuan_yinto_dui_ce_files/shapeimage_3.png" left="0px" top="0px" width="400px" height="259px"/>
</content>
