<?xml version="1.0"?>
<rss xmlns:iweb="http://www.apple.com/iweb" version="2.0">
  <channel>
    <title>Blog</title>
    <link>http://hid2718.github.com/FScript/Blog</link>
    <description>&#x3053;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x306F;&#x3001; F-Script &#x30D3;&#x30AE;&#x30CA;&#x30FC;&#x306B;&#x3068;&#x3063;&#x3066;&#x5F79;&#x7ACB;&#x3061;&#x305D;&#x3046;&#x306A;&#x69D8;&#x3005;&#x306A;&#x60C5;&#x5831;&#x3084;&#x3001; &#x307E;&#x305F;&#x3001;&#x79C1;&#x81EA;&#x8EAB;&#x304C; F-Script &#x3092;&#x4F7F;&#x3044;&#x306A;&#x304C;&#x3089;&#x611F;&#x3058;&#x305F;&#x3053;&#x3068;&#x3001;&#x3084;&#x3063;&#x3066;&#x307F;&#x305F;&#x3053;&#x3068;&#x3084;&#x305D;&#x306E;&#x7D50;&#x679C;&#x306A;&#x3069;&#x3092;&#x3001;&#x81EA;&#x5206;&#x306E;&#x4F53;&#x9A13;&#x3092;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x8A18;&#x9332;&#x3057;&#x3066;&#x884C;&#x3053;&#x3046;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</description>
    <item>
      <title>&#xFF3B;&#x5165;&#x9580;&#xFF3D;F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB; &#x3092;&#x4F7F;&#x3063;&#x3066;&#x307F;&#x308B;</title>
      <link>http://hid2718.github.com/FScript/Blog/entori/2013/2/5_%5Bru_men%5DF-Script_konsoru_wo_shittemiru.html</link>
      <guid isPermaLink="false">95b1f919-7cec-4539-b4a0-99b742afafce</guid>
      <pubDate>Tue, 5 Feb 2013 19:02:05 +0900</pubDate>
      <description>F-Script.app &#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3068;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x300C;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x300D;&#x304C;&#x958B;&#x3044;&#x3066;&#x5165;&#x529B;&#x5F85;&#x3061;&#x306E;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8;&#x304C;&#x51FA;&#x308B;&#x3002;&lt;br/&gt;&#x4F55;&#x3089;&#x304B;&#x306E; F-Script &#x30B3;&#x30FC;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x3053;&#x3053;&#x306B;&#x76F4;&#x63A5;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3057;&#x3066;&#x300C;return&#x300D;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x305B;&#x3070;&#x826F;&#x3044;&#x3002;&lt;br/&gt;&#x5165;&#x529B;&#x3059;&#x3079;&#x304D;&#x30B3;&#x30FC;&#x30C9;&#x304C;&#x8907;&#x6570;&#x884C;&#x306B;&#x6E21;&#x308B;&#x5834;&#x5408;&#x306B;&#x306F;&#x3001;&#x300C;&#x6539;&#x884C;&#x300D;&#x306E;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x300C;Ctrl&#x300D;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089;&#x300C;return&#x300D;&#x3092;&#x62BC;&#x3059;&#x3002;&lt;br/&gt;&#x3053;&#x3046;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x5373;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x306A;&#x304F;&#x3001;&#x305D;&#x3053;&#x3067;&#x300C;&#x6539;&#x884C;&#x300D;&#x3055;&#x308C;&#x3001;&#x7D99;&#x7D9A;&#x3057;&#x3066;&#x6B21;&#x306E;&#x884C;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&lt;br/&gt;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x306F;&#x3001;&#x300C;&#x2191;&#x300D;&#x30AD;&#x30FC;&#x3067;&#x904E;&#x53BB;&#x306E;&#x5165;&#x529B;&#x3092;&#x547C;&#x3073;&#x51FA;&#x305B;&#x308B;&#x30D2;&#x30B9;&#x30C8;&#x30EA;&#x30FC;&#x6A5F;&#x80FD;&#x7B49;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x4FBF;&#x5229;&#x306A;&#x6A5F;&#x80FD;&#x304C;&#x3042;&#x308B;&#x304C;&#x3001;&#x8A73;&#x7D30;&#x306F;&#x3001;&lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html"&gt;F-Script Guide&lt;/a&gt; &#x306E; &lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html#mozTocId188792"&gt;&#xFF13; F-Script &#x306E;&#x4F7F;&#x3044;&#x65B9;&lt;/a&gt; &#x3092;&#x898B;&#x3066;&#x6B32;&#x3057;&#x3044;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x3067;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x69D8;&#x306B;&#x5165;&#x529B;&#x3057;&#x3066;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002;&#x6B21;&#x306E;&#x884C;&#x306B;&#x305D;&#x306E;&#x7D50;&#x679C;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x3001;&#x6B21;&#x306E;&#x5165;&#x529B;&#x3092;&#x4FC3;&#x3059;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8;&#x304C;&#x51FA;&#x308B;&#x3002;&lt;br/&gt;&lt;br/&gt;    &gt; 2 + 3&#x300C;return&#x300D;&lt;br/&gt;    5&lt;br/&gt;&lt;br/&gt;    &gt;&lt;br/&gt;&lt;br/&gt;&#x540C;&#x69D8;&#x306B;&#x3057;&#x3066;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x69D8;&#x306B;&#x5165;&#x529B;&#x3057;&#x3066;&#x3001;&#x7D50;&#x679C;&#x3092;&#x78BA;&#x304B;&#x3081;&#x3066;&#x307F;&#x3088;&#x3046;&#x3002;&lt;br/&gt;&lt;br/&gt;    &gt; a := 2 + 3&#x300C;return&#x300D;&lt;br/&gt;&lt;br/&gt;    &gt; a&#x300C;return&#x300D;&lt;br/&gt;    5&lt;br/&gt;&lt;br/&gt;    &gt; b := 'abc' ++ 'def'&#x300C;return&#x300D;&lt;br/&gt;&lt;br/&gt;    &gt; b&#x300C;return&#x300D;&lt;br/&gt;    'abcdef'&lt;br/&gt;&lt;br/&gt;    &gt; b at: 0&#x300C;return&#x300D;&lt;br/&gt;    'a'&lt;br/&gt;&lt;br/&gt;    &gt; b at: 1&#x300C;return&#x300D;&lt;br/&gt;    'b'&lt;br/&gt;&lt;br/&gt;    &gt; b at: 6&#x300C;return&#x300D;&lt;br/&gt;&lt;br/&gt;    error: index of a a string must be a number less than the length of the string&lt;br/&gt;&lt;br/&gt;    &gt; c := { }&#x300C;return&#x300D;&lt;br/&gt;&lt;br/&gt;    &gt; c addObject: 'a'&#x300C;return&#x300D;&lt;br/&gt;&lt;br/&gt;    &gt; c&#x300C;return&#x300D;&lt;br/&gt;    {'a'}&lt;br/&gt;&lt;br/&gt;    &gt; c addObject: 'b'&lt;br/&gt;&lt;br/&gt;    &gt; c&lt;br/&gt;    {'a', 'b'}&lt;br/&gt;&lt;br/&gt;    &gt; c addObject: 100&lt;br/&gt;&lt;br/&gt;    &gt; c&lt;br/&gt;    {'a', 'b', 100}&lt;br/&gt;&lt;br/&gt;    &gt; &lt;br/&gt;&lt;br/&gt;&#x3055;&#x3042;&#x3001;&#x3053;&#x308C;&#x3067; F-Script &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x3082;&#x6163;&#x308C;&#x305F;&#x3053;&#x3068;&#x3068;&#x601D;&#x3046;&#x3002;&#x5F8C;&#x306F;&#x3001;&lt;a href="http://hid2718.github.io/FScript/Documents.html"&gt;F-Script Guide&lt;/a&gt; &#x3068;&#x3001;&lt;a href="http://hid2718.github.io/FScript/Documents.html"&gt;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&lt;/a&gt;&#x3092;&#x53C2;&#x8003;&#x306B;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x3069;&#x3093;&#x3069;&#x3093;&#x5B9F;&#x9A13;&#x3057;&#x3066;&#x307F;&#x3066;&#x6B32;&#x3057;&#x3044;&#x3002; &#x7279;&#x306B; &lt;a href="http://hid2718.github.io/FScript/F-Script-Guide-ja/F-Script-Guide-1-16-ja.html"&gt;F-Script Guide&lt;/a&gt; &#x306B;&#x306F;&#x3001;F-Script &#x306B;&#x95A2;&#x3059;&#x308B;&#x57FA;&#x672C;&#x7684;&#x306A;&#x77E5;&#x8B58;&#x304C;&#x3001;&#x7CFB;&#x7D71;&#x7ACB;&#x3066;&#x3066;&#x89E3;&#x8AAC;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x4F8B;&#x984C;&#x3082;&#x8C4A;&#x5BCC;&#x306A;&#x306E;&#x3067;&#x3001;&#x8AAD;&#x3080;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x307F;&#x308B;&#x3053;&#x3068;&#x3092;&#x5F37;&#x304F;&#x304A;&#x52E7;&#x3081;&#x3057;&#x305F;&#x3044;&#x3002;&lt;br/&gt;</description>
      <iweb:image href="Media/object074.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://hid2718.github.com/FScript/Blog/entori/2013/2/5_%5Bru_men%5DF-Script_konsoru_wo_shittemiru.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>&#xFF3B;&#x60C5;&#x5831;&#xFF3D;&#x2606;iOS&#x7528;&#x306E;&#x300C;Super Debugger&#x300D;&#x767B;&#x5834;&#x2606;&#x2606;</title>
      <link>http://hid2718.github.com/FScript/Blog/entori/2013/2/3_%5Bqing_bao%5D_F-Script_ben_jiasaitoni_iOS_yongnoSuperDebugger_deng_chang%21.html</link>
      <guid isPermaLink="false">87976548-f8e9-477c-919b-562b1c3a15dd</guid>
      <pubDate>Sun, 3 Feb 2013 21:08:26 +0900</pubDate>
      <description>F-Script &#x672C;&#x5BB6;&#x30B5;&#x30A4;&#x30C8;&#x306E;&#x30C8;&#x30C3;&#x30D7;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x3053;&#x306E; F-Script-ja &#x30B5;&#x30A4;&#x30C8;&#x3078;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x304C;&#x5F35;&#x3089;&#x308C;&#x305F;&#x306E;&#x3068;&#x540C;&#x3058;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x3001;F-Script &#x3092;&#x4F7F;&#x3063;&#x305F;&#x300C; iOS&#x7528;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x958B;&#x767A;&#x652F;&#x63F4;&#x30C4;&#x30FC;&#x30EB; Super Debugger &#x300D;&#x304C;&#x516C;&#x958B;&#x3055;&#x308C;&#x305F;&#x3002;&lt;br/&gt;&#x3053;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x5148;&#x306B;&#x306F;&lt;a href="http://shopify.github.io/superdb/"&gt;&#x300C;Super Debugger for iOS&#x300D;&#x3092;&#x4F7F;&#x3063;&#x3066; iPhone &#x30A2;&#x30D7;&#x30EA;&#x306E; UI &#x3092;&#x958B;&#x767A;&#x3057;&#x3066;&#x3044;&#x308B;&#x69D8;&#x5B50;&#x3092;&#x7D39;&#x4ECB;&#x3059;&#x308B;&#x52D5;&#x753B;&lt;/a&gt;&#x304C;&#x7F6E;&#x304B;&#x308C;&#x3066;&#x3044;&#x3066;&#x3001;&#x3053;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x304C;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;&#x7269;&#x3067;&#x3042;&#x308B;&#x304B;&#x3092;&#x5927;&#x5909;&#x5177;&#x4F53;&#x7684;&#x306B;&#x77E5;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x307E;&#x305A;&#x3001;&#x3053;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x306F;&#x3001;iPhone &#x5074;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x958B;&#x767A;&#x74B0;&#x5883;&#x306E;&#x3042;&#x308B; MacOSX &#x5074;&#x3067;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x958B;&#x767A;&#x652F;&#x63F4;&#x30C4;&#x30FC;&#x30EB;&#x3060;&#x3002;&lt;br/&gt;Objective-C &#x3092;&#x4F7F;&#x3063;&#x305F;&#x901A;&#x5E38;&#x306E;&#x958B;&#x767A;&#x3067;&#x306F;&#x3001;UI &#x306E;&#x3061;&#x3087;&#x3063;&#x3068;&#x3057;&#x305F;&#x4F4D;&#x7F6E;&#x4FEE;&#x6B63;&#x7B49;&#x3067;&#x3082;&#x3001;&#x5909;&#x66F4;&#x306E;&#x90FD;&#x5EA6;&#x3001;&#x518D;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x304C;&#x5FC5;&#x8981;&#x3060;&#x304C;&#x3001;&#x3053;&#x306E; Super Debugger &#x3092;&#x4F7F;&#x3048;&#x3070;&#x3001;&#x518D;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x305B;&#x305A;&#x306B;&#x3001;&#x52D5;&#x7684;&#x306B;&#x5909;&#x66F4;&#x3057;&#x306A;&#x304C;&#x3089;&#x52D5;&#x304B;&#x305B;&#x308B;&#x3001;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x306E;&#x3088;&#x3046;&#x3060;&#x3002;&lt;br/&gt;&#x958B;&#x767A;&#x306E;&#x751F;&#x7523;&#x6027;&#x304C;&#x5287;&#x7684;&#x306B;&#x5411;&#x4E0A;&#x3059;&#x308B;&#x3067;&#x3042;&#x308D;&#x3046;&#x3053;&#x3068;&#x306F;&#x60F3;&#x50CF;&#x306B;&#x96E3;&#x304F;&#x306A;&#x3044;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x4ECA;&#x3084; Cocoa &#x306F;&#x3001;MacOSX &#x3067;&#x306E;&#x958B;&#x767A;&#x3088;&#x308A;&#x3082;&#x3001;iPhone &#x3084; iPad &#x306A;&#x3069;&#x3001;iOS &#x3067;&#x306E;&#x958B;&#x767A;&#x306E;&#x65B9;&#x304C;&#x5727;&#x5012;&#x7684;&#x306B;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x3068;&#x306A;&#x3063;&#x305F;&#x3002;&lt;br/&gt;&#x3057;&#x304B;&#x3057;&#x3001;&#x305D;&#x306E;&#x958B;&#x767A;&#x8005;&#x9054;&#x306E;&#x307B;&#x3068;&#x3093;&#x3069;&#x306F;&#x300C;X-Code = Objective-C + Cocoa&#x300D;&#x3067;&#x958B;&#x767A;&#xFF08;&#x3084; Cocoa &#x306E;&#x52C9;&#x5F37;&#xFF09;&#x3092;&#x884C;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&lt;br/&gt;&#x3053;&#x306E;&#x9818;&#x57DF;&#x3067;&#x3082;&#x3001;F-Script &#x306F;&#x5927;&#x5E45;&#x306A;&#x751F;&#x7523;&#x6027;&#x306E;&#x6539;&#x5584;&#x306B;&#x5BC4;&#x4E0E;&#x3067;&#x304D;&#x308B;&#x306E;&#x306F;&#x9593;&#x9055;&#x3044;&#x306A;&#x304F;&#x3001;&#x4ECA;&#x5F8C;&#x3082;&#x3053;&#x306E; Supe Debugger &#x306E;&#x3088;&#x3046;&#x306A;&#x512A;&#x308C;&#x305F;&#x74B0;&#x5883;&#x304C;&#x66F4;&#x306B;&#x51FA;&#x3066;&#x304F;&#x308C;&#x3070;&#x3001;&#x305D;&#x306E;&#x5B58;&#x5728;&#x304C;&#x5E83;&#x304F;&#x8A8D;&#x77E5;&#x3055;&#x308C;&#x3001;&#x8CA2;&#x732E;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x304B;&#x3068;&#x671F;&#x5F85;&#x3055;&#x308C;&#x308B;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x3053;&#x306E; F-Script-ja &#x3067;&#x3082;&#x3001;&#x4ECA;&#x5F8C;&#x306E;&#x52D5;&#x5411;&#x3092;&#x30A6;&#x30A9;&#x30C3;&#x30C1;&#x3057;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x3002;</description>
      <iweb:image href="Media/object028.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://hid2718.github.com/FScript/Blog/entori/2013/2/3_%5Bqing_bao%5D_F-Script_ben_jiasaitoni_iOS_yongnoSuperDebugger_deng_chang%21.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>&#xFF3B;&#x65E5;&#x8A8C;&#xFF3D;&#x672C;&#x5BB6;&#x30B5;&#x30A4;&#x30C8;&#x306B; F-Script-ja &#x3078;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x304C;&#x3067;&#x304D;&#x305F;&#x2606;&#xFF01;</title>
      <link>http://hid2718.github.com/FScript/Blog/entori/2013/2/3_%5B_ri_zhi%5D%3A_ben_jiasaitoni_F-Script-ja_henorinkugadekita.html</link>
      <guid isPermaLink="false">ef83ff79-1522-4491-a16c-41eaa44fcfa1</guid>
      <pubDate>Sun, 3 Feb 2013 20:10:59 +0900</pubDate>
      <description>&#x6628;&#x5E74;&#x672B;&#x306B;&#x3001;&#x539F;&#x8457;&#x8005;&#x306E; Philippe &#x306B;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x66F8;&#x3044;&#x3066;&#x3001;&#x3053;&#x306E; F-Script-ja &#x30B5;&#x30A4;&#x30C8;&#x306E;&#x4F01;&#x753B;&#x306E;&#x76F8;&#x8AC7;&#x3092;&#x3057;&#x305F;&#x6642;&#x3001;&#x7FFB;&#x8A33;&#x516C;&#x958B;&#x3078;&#x306E;&#x5FEB;&#x8AFE;&#x3068;&#x5171;&#x306B;&#x3001;&#x300C; &lt;a href="http://www.fscript.org/"&gt;www.fscript.org&lt;/a&gt; &#x306B;&#x30EA;&#x30F3;&#x30AF;&#x3092;&#x5F35;&#x308B;&#x304B;&#x3089;&#x3001;&#x516C;&#x958B;&#x3067;&#x304D;&#x305F;&#x3089;&#x30B5;&#x30A4;&#x30C8;&#x306E;URL&#x3092;&#x77E5;&#x3089;&#x305B;&#x3066;&#xFF01;&#x300D;&#x3068;&#x3044;&#x3046;&#x8FD4;&#x4E8B;&#x3092;&#x6234;&#x3044;&#x305F;&#x3002;&#x305D;&#x3053;&#x3067;&#x3001;&#x516C;&#x958B;&#x5F8C;&#x306B;&#x65E9;&#x901F;&#x3001;&#x516C;&#x958B;&#x5B8C;&#x4E86;&#x306E;&#x5831;&#x544A;&#x3068;&#x5171;&#x306B;&#x3053;&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x306E;URL&#x3092;&#x30E1;&#x30FC;&#x30EB;&#x3067;&#x9023;&#x7D61;&#x3057;&#x305F;&#x306E;&#x3060;&#x304C;&#x3001;&#x6570;&#x65E5;&#x524D;&#x306B;&#x4F55;&#x6C17;&#x306A;&#x304F;&#x672C;&#x5BB6;&#x30B5;&#x30A4;&#x30C8;&#x3092;&#x8997;&#x3044;&#x3066;&#x307F;&#x305F;&#x3089;&#x3001;&#x3044;&#x3064;&#x306E;&#x9593;&#x306B;&#x304B;&#x3053;&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x3078;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x304C;&#x3067;&#x304D;&#x3066;&#x3044;&#x305F;&#x2606;&#xFF01;&lt;br/&gt;&#x3053;&#x306E;&#x5C0F;&#x3055;&#x306A;&#x30B5;&#x30A4;&#x30C8;&#x304C;&#x3001;&#x3055;&#x3055;&#x3084;&#x304B;&#x306A;&#x304C;&#x3089;&#x4E16;&#x754C;&#x306B;&#x7E4B;&#x304C;&#x3063;&#x305F;&#x2606; &#x7D20;&#x6674;&#x3057;&#x3044;&#x3002;&lt;br/&gt;</description>
      <iweb:image href="Media/object027.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://hid2718.github.com/FScript/Blog/entori/2013/2/3_%5B_ri_zhi%5D%3A_ben_jiasaitoni_F-Script-ja_henorinkugadekita.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Mountain Lion &#x5BFE;&#x5FDC;: F-Script &#x4E0D;&#x5177;&#x5408;&#x306E;&#x539F;&#x56E0;&#x3068;&#x5BFE;&#x7B56;</title>
      <link>http://hid2718.github.com/FScript/Blog/entori/2013/1/20_Mountain_Lion_dui_ying__F-Script_bu_ju_heno_yuan_yinto_dui_ce.html</link>
      <guid isPermaLink="false">b6e240ab-6df4-45a0-8fe7-9b0bc1a5e50d</guid>
      <pubDate>Sun, 20 Jan 2013 23:19:36 +0900</pubDate>
      <description>F-Script &#x306E;&#x6700;&#x65B0;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3; 2.1 &#x306B;&#x306F;&#x3001;Mac OS X 10.8&#xFF08;Mountain Lion&#xFF09;&#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3068;&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3059;&#x308B;&#x3001;&#x3068;&#x3044;&#x3046;&#x4E0D;&#x5177;&#x5408;&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x304C;&#x5831;&#x544A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&lt;br/&gt;&#x5F53;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x306F;&#x3001;&#x516C;&#x5F0F;&#x30B5;&#x30A4;&#x30C8;&#x304B;&#x3089;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x305F;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3; 2.1 &#x306E; ZIP &#x306B;&#x540C;&#x68B1;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4FEE;&#x6B63;&#xFF06;&#x30EA;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x3001;&#x554F;&#x984C;&#x306E;&#x5BFE;&#x7B56;&#x7248;&#x3092;&#x72EC;&#x81EA;&#x306B;&#x914D;&#x5E03;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000; &#x2192; &lt;a href="https://dl.dropbox.com/u/11990037/F-Script20100614-Rebuild-for-Mountain-Lion-by-hid2718-20130114.zip"&gt;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x306F;&#x3053;&#x3061;&#x3089;&#x304B;&#x3089;&lt;/a&gt;&lt;br/&gt;&#x4EE5;&#x4E0B;&#x306B;&#x3001;&#x305D;&#x306E;&#x5BFE;&#x7B56;&#x306E;&#x6539;&#x4FEE;&#x624B;&#x9806;&#x306B;&#x3064;&#x3044;&#x3066;&#x8A18;&#x9332;&#x3057;&#x3066;&#x304A;&#x304F;&#x3002;&lt;br/&gt;&#x203B; &#x3053;&#x306E;&#x8A18;&#x4E8B;&#x306E;&#x4F5C;&#x696D;&#x74B0;&#x5883;&#xFF1A;Mac OS X 10.6.8 Snow Leopard &#xFF0F; Xcode 3.2.6&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&#x25A0; &#x539F;&#x56E0;&lt;br/&gt;&lt;br/&gt;F-Script &#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x8A18;&#x4E8B;&#x306E;&#x4E00;&#x3064;&#x300C;&lt;a href="http://hid2718.github.com/FScript/AccessingMacOSXFrameworksWithFScript-index-ja.html"&gt;F-Script &#x3067; Mac OS X &#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x7FA4;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&lt;/a&gt;&#x300D;&#x306B;&#x3082;&#x8AAC;&#x660E;&#x304C;&#x3042;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001;F-Script &#x306F;&#x3001;&#x8D77;&#x52D5;&#x6642;&#x306B;40&#x500B;&#x3082;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x81EA;&#x52D5;&#x30EA;&#x30F3;&#x30AF;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&lt;br/&gt;&#x3053;&#x306E;&#x4E2D;&#x306B;&#x306F;&#x3001;F-Script &#x81EA;&#x8EAB;&#x306E;&#x52D5;&#x4F5C;&#x306E;&#x70BA;&#x306B;&#x3082;&#x5FC5;&#x8981;&#x306A;&#x3082;&#x306E;&#xFF08;Foundation Kit &#x3084; Application Kit &#x306A;&#x3069;&#xFF09;&#x3082;&#x5F53;&#x7136;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x305D;&#x306E;&#x307B;&#x3068;&#x3093;&#x3069;&#x306F;&#x3001;&#x4E8B;&#x524D;&#x4F5C;&#x696D;&#x7121;&#x3057;&#x3067;&#x305D;&#x306E;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x304C;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x5229;&#x4FBF;&#x3092;&#x56F3;&#x308B;&#x76EE;&#x7684;&#x3067;&#x30EA;&#x30F3;&#x30AF;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3082;&#x306E;&#x3060;&#x3002;&lt;br/&gt;&#x4ECA;&#x56DE;&#x306E;&#x4E0D;&#x5177;&#x5408;&#x306F;&#x3001;&#x3053;&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306E;&#x5229;&#x4FBF;&#x3092;&#x56F3;&#x308B;&#x76EE;&#x7684;&#x3067;&#x8D77;&#x52D5;&#x6642;&#x306B;&#x81EA;&#x52D5;&#x30EA;&#x30F3;&#x30AF;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x4E00;&#x3064;&#x300C;XgridFoundation&#x300D;&#x304C;&#x3001;Mountain Lion &#x3067;&#x306F;&#x5EC3;&#x6B62;&#x3055;&#x308C;&#x305F;&#x3053;&#x3068;&#x304C;&#x300C;&#x539F;&#x56E0;&#x300D;&#x3067;&#x3042;&#x308B;&#x3002;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&#x25A0; &#x5BFE;&#x7B56;&#x65B9;&#x91DD;&lt;br/&gt;&lt;br/&gt;ML &#x3067;&#x5EC3;&#x6B62;&#x3055;&#x308C;&#x305F;&#x300C;XgridFoundation&#x300D;&#x306F;&#x3001;F-Script &#x81EA;&#x4F53;&#x306E;&#x52D5;&#x4F5C;&#x306B;&#x306F;&#x95A2;&#x4E0E;&#x3057;&#x306A;&#x3044;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3067;&#x3042;&#x308B;&#x70BA;&#x3001;&#x5358;&#x306B;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x69CB;&#x6210;&#x304B;&#x3089;&#x3053;&#x308C;&#x3092;&#x524A;&#x9664;&#x3057;&#x3066;&#x3001;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x76F4;&#x3059;&#x3001;&#x3068;&#x3044;&#x3046;&#x65B9;&#x91DD;&#x3067;&#x6539;&#x4FEE;&#x3092;&#x884C;&#x3063;&#x305F;&#x3002;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&#x25A0; &#x6539;&#x4FEE;&#x624B;&#x9806;&lt;br/&gt;&lt;br/&gt;&#xFF11;&#xFF09;&#x516C;&#x5F0F;&#x30B5;&#x30A4;&#x30C8;&#x304B;&#x3089;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x3066;&#x89E3;&#x51CD;&#x3057;&#x305F;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x300C;source&#x300D;&#x76F4;&#x4E0B;&lt;br/&gt;&#x3000;&#x306B;&#x3042;&#x308B;&#x300C;FScript.xcodeproj&#x300D;&#x3092; Xcode &#x3067;&#x958B;&#x304F;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&lt;br/&gt;&lt;br/&gt;&#xFF12;&#xFF09;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x691C;&#x7D22;&#x300D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x3057;&#x3001;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x5185;&#x300D;&#x3092;&#x5BFE;&#x8C61;&#x306B;&lt;br/&gt;&#x3000;&#x691C;&#x7D22;&#x6587;&#x5B57;&#x5217;&#xFF1A;&#x300C; XgridFoundation&#x300D;&#x3068;&#x5165;&#x529B;&#x3057;&#x3066;&#x691C;&#x7D22;&#x3059;&#x308B;&#x3002;&lt;br/&gt;&#x3000;&#x3053;&#x306E;&#x6587;&#x5B57;&#x5217;&#x3092;&#x542B;&#x3080;&#x7B87;&#x6240;&#x304C;&#x3001;&#xFF13;&#x30AB;&#x6240;&#x898B;&#x3064;&#x304B;&#x3063;&#x305F;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&lt;br/&gt;&lt;br/&gt;&#xFF13;&#xFF09;FSConstantsDictionaryGenerator.m &#x306E;&#x4EE5;&#x4E0B;&#x3092;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x30A2;&#x30A6;&#x30C8;&#x3002;&#x4FDD;&#x5B58;&#x3002;&lt;br/&gt;&#x3000;#import &amp;lt;XgridFoundation/XgridFoundation.h&gt;&lt;br/&gt;&#x3000;&#x3000;&#x2193;&lt;br/&gt;&#x3000;// #import &amp;lt;XgridFoundation/XgridFoundation.h&gt;&lt;br/&gt;&#x3000;&#x3082;&#x3046;&#x4E00;&#x3064;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x8A72;&#x5F53;&#x7B87;&#x6240;&#x306F;&#x3001;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x6587;&#x306E;&#x70BA;&#x3001;&#x305D;&#x306E;&#x307E;&#x307E;&#x3068;&#x3059;&#x308B;&#x3002;&lt;br/&gt;&lt;br/&gt;&#xFF14;&#xFF09; Xcode &#x306E;&#x5DE6;&#x5074;&#x300C;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x3068;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x300D;&#x30DA;&#x30A4;&#x30F3;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B; &#x5404;&#x7A2E;&lt;br/&gt;&#x3000;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x7FA4;&#x306E;&#x6700;&#x5F8C;&#x306B;&#x3042;&#x308B;&#x300C; XgridFoundation.framework&#x300D;&#x306E;&#x4E0A;&#x3067;&lt;br/&gt;&#x3000;&#x53F3;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x300C;&#x524A;&#x9664;&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x3078;&#x306E;&#x30EA;&#x30F3;&#x30AF;&#x3092;&#x5916;&#x3059;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&#x3000;&lt;br/&gt;&lt;br/&gt;&#xFF15;&#xFF09;Xcode &#x30E1;&#x30CB;&#x30E5;&#x30FC;&#xFF1A;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#xFF1E;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x3092;&#x8A2D;&#x5B9A;&#x300D;&lt;br/&gt;&#x3000;&#x3067;&#x300C;F-Script&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&lt;br/&gt;&lt;br/&gt;&#xFF16;&#xFF09; Xcode &#x30E1;&#x30CB;&#x30E5;&#x30FC;&#xFF1A;&#x300C;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#xFF1E;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30D3;&#x30EB;&#x30C9;&#x69CB;&#x6210;&#x3092;&#x8A2D;&#x5B9A;&#x300D;&lt;br/&gt;&#x3000;&#x3067;&#x300C;Deployment&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&lt;br/&gt;&lt;br/&gt;&#xFF17;&#xFF09; Xcode &#x30E1;&#x30CB;&#x30E5;&#x30FC;&#xFF1A;&#x300C;&#x30D3;&#x30EB;&#x30C9;&#xFF1E;&#x30D3;&#x30EB;&#x30C9;&#x300D;&#x3092;&#x9078;&#x629E;&#x3002;&lt;br/&gt;&#x3000;&#x30D3;&#x30EB;&#x30C9;&#x304C;&#x5B8C;&#x4E86;&#x3059;&#x308B;&#x3068;&#x3001;&#x89E3;&#x51CD;&#x3057;&#x305F;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x4E2D;&#x306E;&#x300C;source / build&#x300D;&#x306E;&#x4E0B;&lt;br/&gt;&#x3000;&#x306B;&#x300C;Deployment&#x300D;&#x3068;&#x3044;&#x3046;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x304C;&#x3067;&#x304D;&#x3001;&#x305D;&#x306E;&#x4E2D;&#x306B;&#x4ECA;&#x56DE;&#x306E;&#x30D3;&#x30EB;&#x30C9;&#x7D50;&#x679C;&lt;br/&gt;&#x3000;&#x3067;&#x3042;&#x308B;&#x300C;F-Script.app&#x300D;&#x304C;&#x751F;&#x6210;&#x3055;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;&#x3053;&#x308C;&#x3092;&#x3001;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306E;&#x76F4;&#x4E0B;&#x306B;&lt;br/&gt;&#x3000;&#x30B3;&#x30D4;&#x30FC;&#x3057;&#x3066;&#x3001;&#x4ECA;&#x56DE;&#x306E;&#x6539;&#x4FEE;&#x4F5C;&#x696D;&#x306F;&#x7D42;&#x4E86;&#x3002;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&#x25A0; &#x52D5;&#x4F5C;&#x78BA;&#x8A8D;&lt;br/&gt;&lt;br/&gt;&#xFF18;&#xFF09;&#x4ECA;&#x56DE;&#x306E;&#x6539;&#x4FEE;&#x7D50;&#x679C;&#x3092; Mountain Lion &#x74B0;&#x5883;&#x4E0B;&#x3067;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3001;&#x7121;&#x4E8B;&#x306B;&#x52D5;&#x4F5C;&#x3059;&#x308B;&lt;br/&gt;&#x3000;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3001;&#x3054;&#x9023;&#x7D61;&#x3092;&#x4E0B;&#x3055;&#x3063;&#x305F; &lt;a href="https://twitter.com/kuritar"&gt;@kuritar&lt;/a&gt; &#x3055;&#x3093;&#x306B;&#x6DF1;&#x304F;&#x611F;&#x8B1D;&#x81F4;&#x3057;&#x307E;&#x3059;&#x3002;&lt;br/&gt;&#x3000;&#x3042;&#x308A;&#x304C;&#x3068;&#x3046;&#x3054;&#x3056;&#x3044;&#x307E;&#x3057;&#x305F;&#xFF01;&lt;br/&gt;&lt;br/&gt;</description>
      <iweb:image href="Media/object225.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://hid2718.github.com/FScript/Blog/entori/2013/1/20_Mountain_Lion_dui_ying__F-Script_bu_ju_heno_yuan_yinto_dui_ce.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>F-Script &#x3092; Mac &#x306B;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3059;&#x308B;</title>
      <link>http://hid2718.github.com/FScript/Blog/entori/2013/1/15_F-Script_wo_Mac_niinsutorusuru.html</link>
      <guid isPermaLink="false">879c3b0c-713e-4174-aae2-54914e47f70a</guid>
      <pubDate>Tue, 15 Jan 2013 19:35:15 +0900</pubDate>
      <description>&#x25A0; Mac OS X 10.6 Snow Leopard &#xFF0F; 10.7 Lion &#x306E;&#x5834;&#x5408;&lt;br/&gt;&lt;br/&gt;F-Script &#x306E;&#x6700;&#x65B0;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x306F;&#x300C; F-Script 2.1 &#x300D;&#x3060;&#x3002;&lt;br/&gt;&#x516C;&#x5F0F;&#x30B5;&#x30A4;&#x30C8;&#x306E; &lt;a href="http://www.fscript.org/index.htm"&gt;HOME&lt;/a&gt; &#x304B;  &lt;a href="http://www.fscript.org/download/download.htm"&gt;DOWNLOAD&lt;/a&gt; &#x304B;&#x3089;ZIP&#x5F62;&#x5F0F;&#x3067;&#x5165;&#x624B;&#x3067;&#x304D;&#x308B;&#x3002;&lt;br/&gt;&#x74B0;&#x5883;&#x304C; Mac OS X 10.6 Snow Leopard &#x304B; 10.7 Lion &#x306E;&#x5834;&#x5408;&#x306F;&#x3001;&#x3053;&#x308C;&#x3092;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3059;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;&#xFF08; 10.8 Mountain Lion &#x3067;&#x306F;&#x4E0D;&#x5177;&#x5408;&#x3042;&#x308A;&#xFF01;&#x5F8C;&#x8FF0;&#x3002;&#xFF09;&lt;br/&gt;ZIP &#x3092;&#x89E3;&#x51CD;&#x3059;&#x308B;&#x3068;&#x300C;F-Script20100614&#x300D;&#x3068;&#x3044;&#x3046;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x304C;&#x51FA;&#x3066;&#x304F;&#x308B;&#x3002;&#x2028;&#x3053;&#x306E;&#x76F4;&#x4E0B;&#x306B;&#x3042;&#x308B;&#x300C;F-Script&#xFF08;.app&#xFF09;&#x300D;&#x3092;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306B;&#x30B3;&#x30D4;&#x30FC;&#x3059;&#x308C;&#x3070;&#x3001;F-Script &#x672C;&#x4F53;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x306F;&#x5B8C;&#x4E86;&#x3060;&#x3002;&lt;br/&gt;&#x3053;&#x308C;&#x3092;&#x30C0;&#x30D6;&#x30EB;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x3059;&#x3050;&#x306B; F-Script &#x3092;&#x4F7F;&#x3044;&#x59CB;&#x3081;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x25A0; Mac OS X 10.8 Mountain Lion &#x306E;&#x5834;&#x5408;&lt;br/&gt;&lt;br/&gt;&#x3053;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x306F; Mac OS X 10.6&#xFF08;Snow Leopard&#xFF09;&#x4EE5;&#x964D;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x305F;&#x3082;&#x306E;&#x306A;&#x306E;&#x3060;&#x304C;&#x3001;Mac OS X 10.8 Mountain Lion &#x3067;&#x306F;&#x3001;&#x8D77;&#x52D5;&#x6642;&#x306B;&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3057;&#x3066;&#x3057;&#x307E;&#x3046; &#x3068;&#x3044;&#x3046;&#x4E0D;&#x5177;&#x5408;&#x304C;&#x5831;&#x544A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&lt;br/&gt;&#x3057;&#x304B;&#x3082;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x30B0;&#x30EB;&#x30FC;&#x30D7;&#x306E;&#x8CA2;&#x732E;&#x3067;&lt;a href="https://groups.google.com/forum/?fromgroups=#!topic/f-script/QtBuJ7HE7Yk"&gt;&#x539F;&#x56E0;&#x304C;&#x5224;&#x660E;&#x3057;&#x3066;&#x3044;&#x308B;&lt;/a&gt;&#x306B;&#x3082;&#x62D8;&#x3089;&#x305A;&#x3001;&#x5BFE;&#x7B56;&#x7248;&#x306E;&#x516C;&#x5F0F;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x306F;&#x307E;&#x3060;&#x306A;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x3002;&#x958B;&#x767A;&#x8005; Philippe Mougin &#x306E;&#x4E8B;&#x60C5;&#x3067;&#x3001;&#x5BFE;&#x5FDC;&#x4F5C;&#x696D;&#x306B;&#x6642;&#x9593;&#x3092;&#x5272;&#x3051;&#x306A;&#x3044;&#x72B6;&#x6CC1;&#x304C;&#x7D9A;&#x3044;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x3060;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x305D;&#x3053;&#x3067;&#x3001;&#x3053;&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x306F;&#x3001;&#x72EC;&#x81EA;&#x306B;&#x5BFE;&#x7B56;&#xFF06;&#x30EA;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x305F;&#x3082;&#x306E;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3066;&#x914D;&#x5E03;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;&lt;a href="https://dl.dropbox.com/u/11990037/F-Script20100614-Rebuild-for-Mountain-Lion-by-hid2718-20130114.zip"&gt;&#x3053;&#x3053;&#x304B;&#x3089;&lt;/a&gt; &#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x3066;&#x6B32;&#x3057;&#x3044;&#x3002;&lt;br/&gt;&lt;br/&gt;&#x2605;&#x8B1D;&#x8F9E;&lt;br/&gt;&lt;br/&gt;&#x3053;&#x306E;&#x554F;&#x984C;&#x3092;&#x3054;&#x6559;&#x793A;&#x4E0B;&#x3055;&#x308A;&#x3001;&#x3053;&#x306E;&#x30EA;&#x30D3;&#x30EB;&#x30C9;&#x7248;&#x306E; Mountain Lion &#x74B0;&#x5883;&#x3067;&#x306E;&#x52D5;&#x4F5C;&#x78BA;&#x8A8D;&#x307E;&#x3067;&#x884C;&#x3063;&#x3066;&#x4E0B;&#x3055;&#x3063;&#x305F; &lt;a href="https://twitter.com/kuritar"&gt;@kuritar&lt;/a&gt; &#x3055;&#x3093;&#x306B;&#x3001;&#x6DF1;&#x304F;&#x611F;&#x8B1D;&#x81F4;&#x3057;&#x307E;&#x3059;&#x3002;&lt;br/&gt;</description>
      <iweb:image href="Media/object001.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://hid2718.github.com/FScript/Blog/entori/2013/1/15_F-Script_wo_Mac_niinsutorusuru.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>F-Script &#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x65E5;&#x672C;&#x8A9E;&#x8A33;&#x306E;&#x4EEE;&#x516C;&#x958B;&#x3092;&#x958B;&#x59CB;&#x2606;&#xFF01;</title>
      <link>http://hid2718.github.com/FScript/Blog/entori/2013/1/4_F-Script_dokyumento_ri_ben_yu_yino_jia_gong_kaiwo_kai_shi%21.html</link>
      <guid isPermaLink="false">1fe91040-7d7b-4886-a7fb-4ee718fe8d2e</guid>
      <pubDate>Fri, 4 Jan 2013 02:33:51 +0900</pubDate>
      <description>&#x601D;&#x3044;&#x7ACB;&#x3063;&#x3066;&#x3001;&#x6570;&#x30F6;&#x6708;&#x524D;&#x304B;&#x3089; F-Script &#x516C;&#x5F0F;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x7FFB;&#x8A33;&#x3092;&#x59CB;&#x3081;&#x305F;&#x3002;&lt;br/&gt;&#x30DA;&#x30FC;&#x30B9;&#x306F;&#x975E;&#x3063;&#x5E38;&#x30FC;&#x306B;&#x30B9;&#x30ED;&#x30FC;;; &#x305D;&#x308C;&#x3067;&#x3082;&#x8A33;&#x6587;&#x304C;&#x3044;&#x304F;&#x3064;&#x304B;&#x3067;&#x304D;&#x3066;&#x304D;&#x305F;&#x306E;&#x3067;&#x3001;&#x5C11;&#x3057;&#x305A;&#x3064; Web &#x3067;&#x516C;&#x958B;&#x3057;&#x3066;&#x884C;&#x304F;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;&lt;br/&gt;&#x5E74;&#x672B;&#x304B;&#x3089; GitHub &#x306B;&#x516C;&#x958B;&#x7528;&#x306E;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x3092;&#x7528;&#x610F;&#x3057;&#x3001;iWeb &#x3067;&#x30B5;&#x30A4;&#x30C8;&#x3092;&#x5236;&#x4F5C;&#x3002;&lt;br/&gt;&#x4ECA;&#x65E5;&#x3001;&#x6F38;&#x304F;&#x3001;&#x3068;&#x308A;&#x3042;&#x3048;&#x305A;&#x306E;&#xFF08;&#x4EEE;&#xFF09;&#x516C;&#x958B;&#x6E96;&#x5099;&#x304C;&#x6574;&#x3063;&#x305F;&#xFF01;&lt;br/&gt;&lt;br/&gt;&#x3053;&#x3053;&#x307E;&#x3067;&#x8FBF;&#x308A;&#x7740;&#x304F;&#x306E;&#x306B; &lt;a href="http://www.smalltalk-users.jp/"&gt;Smalltalk&#x52C9;&#x5F37;&#x4F1A;&lt;/a&gt; &#x306E;&lt;a href="https://twitter.com/umejava"&gt;&#x6885;&#x6FA4;&#x3055;&#x3093;&lt;/a&gt;&#x3068;&lt;a href="https://twitter.com/tetha"&gt;&#x6797;&#x3055;&#x3093;&lt;/a&gt;&#x306B;&#x306F;&#x601D;&#x3044;&#x3063;&#x5207;&#x308A;&#x304A;&#x4E16;&#x8A71;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x611F;&#x8B1D;&#xFF01;&#x3067;&#x3059;&#x3002;&lt;br/&gt;&#x3053;&#x306E;&#x5834;&#x3092;&#x501F;&#x308A;&#x3066;&#x3001;&#x539A;&#x304F;&#x539A;&#x304F;&#x5FA1;&#x793C;&#x7533;&#x3057;&#x4E0A;&#x3052;&#x307E;&#x3059;&#x3002; &lt;br/&gt;&lt;br/&gt;&#x6700;&#x5F8C;&#x306B;&#x3001; F-Script &#x306E;&#x958B;&#x767A;&#x8005; Mr. Philippe Mougin &#x306B;&#x306F;&#x3001; &#x8457;&#x4F5C;&#x7269;&#x306E;&#x65E5;&#x672C;&#x8A9E;&#x3078;&#x306E;&#x7FFB;&#x8A33;&#x3068; Web &#x516C;&#x958B;&#x306B;&#x95A2;&#x3059;&#x308B;&#x79C1;&#x306E;&#x554F;&#x5408;&#x305B;&#x306B;&#x5BFE;&#x3057;&#x3001;&#x307B;&#x3093;&#x306E;&#x6570;&#x6642;&#x9593;&#x3067;&#x300C;&#x5FEB;&#x8AFE;&#x300D;&#x306E;&#x8FD4;&#x4FE1;&#x3092;&#x6234;&#x304D;&#x307E;&#x3057;&#x305F;&#x3002;&#x8FC5;&#x901F;&#x3067;&#x6E29;&#x304B;&#x3044;&#x5BFE;&#x5FDC;&#x306B;&#x6DF1;&#x304F;&#x611F;&#x8B1D;&#x81F4;&#x3057;&#x307E;&#x3059;&#x3002;&lt;br/&gt;&lt;br/&gt;Thank you, Mr. Philippe Mougin !</description>
      <iweb:image href="Media/object000.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://hid2718.github.com/FScript/Blog/entori/2013/1/4_F-Script_dokyumento_ri_ben_yu_yino_jia_gong_kaiwo_kai_shi%21.html#comment_layer"></iweb:comment>
    </item>
    <iweb:dateFormat>yyyy&#x5E74;M&#x6708;d&#x65E5;EEEE</iweb:dateFormat>
    <iweb:baseURL>http://hid2718.github.com/FScript/Blog</iweb:baseURL>
    <iweb:maximumSummaryItems>10</iweb:maximumSummaryItems>
  </channel>
</rss>
